[
    {
        "title": "What is your most intense, edge of your seat, movie scene?",
        "body": "What movie scene resonates with you the most in terms of being super intense/heart racing/edge of your seat type feeling?  Examples could include, the TRex scene in Jurassic Park, the basement scene in Blair Witch, the docking scene in Interstellar, the coin flip scene in No Country for Old Men, etc.  What do you rank as your most intense scene?",
        "date": "12/21/2022, 00:44:51"
    },
    {
        "title": "What movie in 2022 surprised you or exceeded your expectations?",
        "body": "No matter how jaded we are, no matter how many ok movies we've seen this year, there are always a few that surprise us. A director's unexpected debut, a film that breathed new life into an old genre or a B-movie that was way more entertaining than a bunch of movies with twice the budget. What was this year's revelation for you?",
        "date": "12/21/2022, 00:40:20"
    },
    {
        "title": "What Is The Best Christmas Movie?",
        "body": "it seems wild to me that christmas is five days away and i've only watched two movies that have a christmas vibe to it (and if you're curious - it was both home alone and the santa clause). i've asked this question to a few of my friends and someone told me that their top christmas movie was arthur christmas and that movie doesnt even land in my top twenty.  so please help me end this debate once and for all - what is the best of the best christmas movie?",
        "date": "12/21/2022, 00:38:35"
    },
    {
        "title": "I wish Nolan would make more mind-f*** movies versus historical ones…",
        "body": "This might be a hot take, but I wish Christopher Nolan would make more mind-fuck movies (Interstellar, Inception, Tenet, Memento etc) versus dramatic historical movies (Dunkirk, Oppenheimer).  While I will say that Dunkirk is a really good movie and I have no doubt that Oppenheimer will be another good entry in Nolan's filmography, I would rather him focus on making movies that leave you thinking about it for days because you are so mind-fucked from it and wonder how in the world he (and his team) can come up with the ideas that they do.  Maybe I am alone in this and no one else thinks the same…  Less historical movies, more “holy shit, that was incredible and I am still trying to wrap my mind about this” ones…",
        "date": "12/21/2022, 00:31:20"
    },
    {
        "title": "Without mentioning anything to do with how beautiful it is, why do people like Dune?",
        "body": "Honestly I tried my best to find anything good in it, not even just to personally like it but to think this is a good movie and I seriously can't. It's a shame because Villeneuve is one of my favourite modern day directors and now he's tied up doing this dreck for the next decade or so when he could be making a whole host of more interesting films.  It honestly feels like the futurama joke of a film in slow motion, nothing of interest happens the entire time. Characters just seem to get on with the plot, and the plot is the most generic blockbuster plotline I've ever seen, especially when you consider at least the standard generic blockbuster has a bloody ending! This film just stopped and I remember being in the cinema, everyone clapping and being happy and that and just thinking what the fuck did we see a different film? It was the worst movie I've ever seen in the cinema and that includes when I saw Grown Ups 2 with Adam Sandler (at least it was half the length and had jokes that even if they didn't make you laugh got some kind of reaction out of you).  I tried watching it again today and I had to turn it off an hour and a half in. Even the beautiful cinematography the film is praised for feels dull to me. Big empty halls of brown with a bit of light, and characters that sit there reading the script with zero emotion. Nothing stands out, there's a 10 minute long bit where he talks to a gardener and the gardener is like these trees are so important then the trees get burnt down half an hour later and it was filmed like that was a big emotional moment. Seriously, whilst I weren't a fan of the book I could at least understand who it was after, it had a great plot with complicated characters and there was no clear good guys and bad guys. But in this film the good guys go out of their way to save people, and the bad guys all look like nazis living on their big nazi planet. Fuck me. What a waste of time, not for me watching it, but for all the cast and crew that spent months/years of their life on the most intricately painted yellow/grey wall ever.",
        "date": "12/21/2022, 00:28:56"
    },
    {
        "title": "what movie is your guilty pleasure?!",
        "body": "Has it ever happened to you? You go to a movie not knowing anything about it and you really enjoy the movie afterwards you go online just to see everyone hating it! I'm sure it happened to the most of us.I remember back when I watched spiderman 3 It immediately became my favorite movie I've ever watched,a few years later I found it so shocking that everyone was saying it's a bad movie so I went back and rewatched it again even though I've rewatched it multiple times throughout the years I realized what people were saying,It's not a well made movie at all but with all that I was still enjoying it knowing it was mid,another one was Ready player one (2018),I just went to it knowing Spealberg made it and enjoyed the hell outta that movie but it seemed like people didn't like it that much.So I was just wondering what movie do you like that others find bad or goofy.thanks",
        "date": "12/21/2022, 00:23:26"
    },
    {
        "title": "Would Terminator 2 be as beloved if it wasn't for the groundbreaking special effects?",
        "body": "I recently had to watch Terminator 2 for my history of special effects course and I'm having a hard time seeing why it is so loved. The T-1000 was a game changing villain with the liquid medal CGI that would go on to change movies and special effects from that point forward, but what else do people love about this movie? I found the writing, especially for the kid actor, to be subpar and often times (for lack of a better word) corny. Arnold obviously has some iconic lines and that's all great, but other than that I thought the only real highlight to be Robert Patrick. Can someone please enlighten me why this is still considered to be a classic with movies like Jurassic Park or The Matrix? Is it just the nostalgia?  EDIT: Thank you to those who gave real answers. I didn't know asking a discussion question in a movie sub was so disliked around here. My apologies.",
        "date": "12/21/2022, 00:08:19"
    },
    {
        "title": "A New Holiday Favorite",
        "body": "I went with the family last night to watch Violent Night. I wasn't sure what to expect, but it turned out to be one of the better movies I've ever seen, as well as possibly the best Christmas movie ever (I understand that is a subjective statement).  It was very humorous, had great action, and presented a new backstory to where Santa Clause came from. I do not want to spoil it for anyone going to see it so I'll say no more, except go watch it.",
        "date": "12/20/2022, 23:59:16"
    },
    {
        "title": "Clint Eastwood has never won an Oscar as an actor, what do you think about that?",
        "body": "He won it 4 times but not as an actor, he was nominated for it as an actor only twice and didn't win it.  I know that it is not only related to his performance, but also to the performance of the other actors in the other nominated movies, but:  In your opinion, did Clint really never deserve to win it as an actor in his entire career? And if you think he deserves to win it, which movie do you think he should have won for best Actor?",
        "date": "12/20/2022, 23:52:32"
    },
    {
        "title": "Which Indian movie deserves the Oscars?",
        "body": "I know there are lots of Indian movies out there which was amazing but due to lack exposure and restrictions they haven't got nominated for awards like Oscars.  Movies like Tumbbad, Swades, Rang De Basanti would have won atleast one award if would have sent for Oscars.  Some movies have got mesmerizing original soundtracks but again never got any nomination.   Slumdog millionaire was nowhere close to movies I mentioned above still won multiple academy awards.   What you guys think?",
        "date": "12/20/2022, 23:39:16"
    },
    {
        "title": "ADDAMS FAMILY VALUES gave us everything we wanted in a comedy. Joan Cusack and Christina Ricci stole the show as Debbie Jellinsky and Wednesday Addams. The rare sequel which surpasses the original.",
        "body": "It's one of those films I never tire of because of how witty and campy the film is. A lot of it is due to Paul Rudnick, who is known for his shady writing.   Nevertheless, I couldn't stop laughing at Joan Cusack's Malibu Barbie rant or the Camp Chippewa scenes where Wednesday and Pugsley are punished by being forced to watch Disney movies or a kid has a nervous breakdown after seeing a picture of Michael Jackson.   Anjelica Huston is always a highlight as Morticia though her best line happens when she has a confrontation with Debbie, a mix of anger and respect:  >But Debbie,....Pastels?",
        "date": "12/20/2022, 23:25:21"
    },
    {
        "title": "Gremlins the forgotten Christmas movie",
        "body": "Everyone talks about Diehard as the greatest non Christmas Christmas Movie  &#x200B;  But Gremlins needs to be brought up more.  What's interesting is Gremlins is undeniably a christmas movie.   The Mogwai is a christmas gift  gone wrong.  and that is the theme of Gremlins in it's entirety. Christmas gone wrong.  the film delights in destroying Christmas tropes. Even reminding us some people have a lot to mourne at christmas.  Amazing cast great gags,   There's homages to Miracle on 34th st, & It's A wonderful life. it's full of easter eggs about Indiana Jones.  it strike the perfect balance between horror Comedy and the holidays.     SO. lets shout out to Billy Pete Kate Gizmo Spike and the rest. And Merry Christmas!!!!!!",
        "date": "12/20/2022, 23:15:42"
    },
    {
        "title": "The Gauntlet suggestions for Christmas.",
        "body": "Every year I try to force friends and family to watch a series of increasingly inexplicable movies that are part of some series or lineage of remakes. A few years ago I started with the Babes in Toyland series from 1934, 1961, and 1986. Then I did a series with movies about becoming Santa, but they weren't so-bad-it's-good. Other than Santa Claus Conquers the Martians, what would you suggest?",
        "date": "12/20/2022, 22:55:07"
    },
    {
        "title": "What's the best prequel of all time?",
        "body": "Prequels or often bashed, but there are some good ones. Revenge of the Sith, Rise of the Planet of the Apes trilogy, Rogue One, X Men First Class, Captain America, and many others are films that are actually really good. Doesn't have to be better than the OG, but what's a prequel film or TV series that is good, and by contrast, what's one that sucks?",
        "date": "12/20/2022, 22:30:50"
    },
    {
        "title": "As Movies with Great Scenes",
        "body": "Someone asked what are great movies with a bad scene so let's flip it and ask what is a bad or even a mediocre movie that has a great scene.?  For me it's Matrix Reloaded. The movie was such a disappointment after the first matrix and wow was that ending with the architect an anti climatic letdown. “Hey let's talk with big words! Hope you brought your dictionary.”  Oh and let's not forget the weird cave rave / orgy scene. Whatever the hell that was.   However the Highway chase scene was awesome. One of the best action sequences I have seen in a movie. I sometime just start the movie at the chateau and watch it from there.",
        "date": "12/20/2022, 22:19:29"
    },
    {
        "title": "Who is actually responsible for the previews/trailers before the movie at the cinema?",
        "body": "We went to see the new Avatar this weekend, and the previews/trailers went on for 40 minutes. The showtime said 7:45 but the movie did not start rolling until 8:25.  It used to be 15 minutes of trailers when did this change? Im actually curious who decides how long to show previews and how many/what previews they show.",
        "date": "12/20/2022, 22:18:40"
    },
    {
        "title": "What movie can you just not finish, no matter how hard you try?",
        "body": "I have been watching blade Runner 2049 now for almost a year. I always start it, and by halfway I am asleep or on to the next activity.  &#x200B;  When I restart it a week or month later, I realize that I don't remember half of the earlier scenes that I should have. Making me think that I fell asleep earlier than usual.  &#x200B;  One day I will finish it...  &#x200B;  Edit: It seems 2001: A Space Odyssey is a very popular choice.",
        "date": "12/20/2022, 22:07:03"
    },
    {
        "title": "Please give me more quirky films with a bit of absurdity.",
        "body": "I'm not sure if that's the best way to describe it, but here are some films I've seen that fit what I'm looking for:  Lars and the Real Girl  History of Future Folk  Ruby Sparks  Eternal Sunshine of the Spotless Mind  Wristcutters  The Lobster  Seeking a Friend for the End of the World  Safety Not Guaranteed  Amelie  The Science of Sleep  Swiss Army Man  Castaway on the Moon",
        "date": "12/20/2022, 21:59:03"
    },
    {
        "title": "Which actors/actresses careers were destroyed/helped by just one movie?",
        "body": "For destroyed Demi Moore with G.I. Jane always comes to mind and doesn't really help the fact that Striptease was the year before that as well. She just disappeared.  Gigli was god awful. Didn't ruin Ben Affleck or JLo, although director Martin Brest on the other hand..  For most helped I believe it has to be either Al Pacino in Godfather or Bruce Willis in Die Hard.",
        "date": "12/20/2022, 21:33:00"
    },
    {
        "title": "What's a criteria that you use for picking a movie to watch?",
        "body": "I have found that movies which are successful in the box office are usually good enough.Sometimes it fails though(Looking at you F9) but most of the times it does work. It turned out that there is something at least barely something that would have been watchable about the movie 'cause a lot of people obviously went to the theatres and gave their money to watch it.  While box office is not always the best criteria, most of the times it does work. The Shawshank Redemption is one of the few movies that consistently reminds me that Box Office is not everything.  When it comes to movies on streaming though, it's based on Word of Mouth from Youtube. I've found that rotten tomatoes reviews and even Top 10 trending charts don't matter cause the former most of the times is too less and the latter can be easily manipulated by the streamer. Mostly the streaming movies sucked but I came to love Tomorrow War and Do Revenge based on YouTube recommendations.  I sometimes use critic reviews and IMDb reviews in case of tie breaks. What is your criteria for picking a movie to see?",
        "date": "12/20/2022, 21:20:30"
    },
    {
        "title": "Recommend dome movies similar to What every french woman wants?",
        "body": "After three long years of absence, 15-year-old boarding school student Roger returns home to spend his summer vacation. And brimming with ever-growing sexual curiosity, Roger realises that his parents' mansion is a tantalising playground full of women and dirty little secrets. But as Roger's dormant teenage sexual force awakens, suddenly, WWI breaks out, and from a docile and gentle kid, Roger transforms into a kinky rascal left all alone to console the lonely and unprotected women like a rooster in a hen house. Now, surrounded by temptation, Roger has no choice but to expand his education in titillating ways.",
        "date": "12/20/2022, 21:08:02"
    },
    {
        "title": "what is a perfect, or improved, film adaptation of a book?",
        "body": "Just saw a post about unfaithful or poor movie adaptations based on books. It got me thinking about what film adaptations captured the story near perfectly. In my opinion No Country For Old Men is an incredible adaptation of the source material. They changed Antons appearance in the movie from the book, and cut out maybe one scene. But none of these slight changes detract or change the story. The cast works really well for the characters. It is my favorite Cormac McCarthy adaptation.  Or if it didn't capture the story, maybe it took liberties that improved it. Like John Carpenters The Thing, or David Finchers Fight Club. What are some of the best adaptations or improvements you have seen?",
        "date": "12/20/2022, 20:50:58"
    },
    {
        "title": "Movies that you respect but did not enjoy watching",
        "body": "Essentially, movies that you can recognize were well made, had artistic value etc. But just did not like or connect with for one reason or another.  The Shining made me feel this way, I could see how well it was made, and why so many people praise it, but I just could not connect with the story and I never felt scared watching it. Is there any movie that made you feel this way?",
        "date": "12/20/2022, 20:40:25"
    },
    {
        "title": "Which movie (live action or animated) shows some movies are best done in animated form?",
        "body": "Animated movies  has unique abilities, it can shows show controversial or hardcore subjects which is difficult to show in live action, it can show concept or visual which is difficult or costly to be shown in live action  For me I would say loving Vincent would be perfect candidate for this. I think the way it showed life of van GogG wouldn't be possible in live action",
        "date": "12/20/2022, 20:37:23"
    },
    {
        "title": "Does someone know this movie??",
        "body": "When I was a kid I saw this movie like a lot, i don't remember the plot as I wanted and I couldn't find it whit google and this website called like what is my movie or something like that, well the movie is a comedy about a girl who trapped her parents in her house because they had an argue and they didn't let her have a boyfriend so she tripped them but then she apologize to them and end with this guy and there were a joke where some girl said that she remains a virgin because she had anal sex and she hasn't done anything wrong at gods eyes or something like that i also remind that her dad has lig long hair and a large beard the movie was in these early's 2010s not",
        "date": "12/20/2022, 20:36:47"
    },
    {
        "title": "What was the last movie that really advanced the art of special effects?",
        "body": "Every once in a while a movie comes out that blows us away with some major advance in effects - 2001, Terminator 2, Jurassic Park, Toy Story to throw a few examples out there.  It feels like these days every other movie has a ton of effects thrown in and CG is mostly pretty good now - so just doing more and bigger (let's blow up a building, no a city block, no a city, no a planet...) is not really pushing anything forward other than the capacity of render farms / the animator's ability to use copy & paste.  So - give me some movies that have really pushed the art forwards, be it practical effects or CG?",
        "date": "12/20/2022, 20:36:15"
    },
    {
        "title": "Esobar: Paradise Lost. Anyone understand the ending?",
        "body": "So, yesterday night I watched Escobar: Paradise Lost. It was nothing what I expected, but in a good way, because Pablo was really a family man who was reading stories to his daughter while sending people to kill others.    But in the ending, I didn't get it what happened: i know he would never kill Maria, so I guess he sent his man to take her back to be with their family, and killed Nick? Whats you guys think?",
        "date": "12/20/2022, 20:11:39"
    },
    {
        "title": "Paramount are calling the MI: Dead Reckoning stunt the biggest in cinema history. What are some stunts that could compete?",
        "body": "I guess it depends on how you define Biggest but in recent times The Dark Knight Rises plane stunt comes to mind as well as the opening of Goldeneye.  Back in the 50's productions like Ben Hur were doing incredibly dangerous stunts. Is Dead Reckoning really the biggest or do you guys think it's all marketing?",
        "date": "12/20/2022, 19:39:10"
    },
    {
        "title": "Fantastic Four: Rise of the Silver Surfer is a good movie",
        "body": "I know, I know. Those first Fantastic Four movies aren't perfect but they do offer some genuine light hearted fun, especially the second one. Silver Surfer is a damn captivating foe, the action scenes are pretty great, especially that chase scene between Jonny Storm and the Silver Surfer and its just an all around good time.   Yeah, the story isn't the most complex and the humour pretty hit or miss, but the whole cast delivers solid performances. Galactus is just a cloud, but whatever. He's in the last 20 minutes of the movie only and I doubt 2008 effects would have made justice to that thing either way.",
        "date": "12/20/2022, 19:18:18"
    },
    {
        "title": "What are some movies I can and should watch with complete ignorance?",
        "body": "I saw Paths of Glory and The Kid Detective knowing almost nothing about them and I since I can't selectively erase my own memories I want to watch a movie that I know nothing about but can be reasonably confident it will be good. I think very new or very obscure movies are what I have to pick from. What are your recommendations?",
        "date": "12/20/2022, 19:06:21"
    },
    {
        "title": "The Shape of Water, why?",
        "body": "As a fan of Del Toro, Doug Jones and even Mike Hill going in; I enjoyed it. I was happy that a story and film like this could get made at this scale today. Then it swept the Oscars; as a fan of the genre I was happy, but why? Was it really this universally loved?   Its as close to seeing a horror movie win best picture as I'll get. Thankful, but in your opinion was it warranted? 4 years late, does it hold up?",
        "date": "12/20/2022, 18:45:20"
    },
    {
        "title": "What would be some of the flaws of Malena (2000)?",
        "body": "Was looking at my own IMDB ratings and discovered that this film is the only one I've ever given a perfect 10 score among +2500 films I've rated. To me it's flawless; powerful coming of age story, incredible Oscar nominated cinematography, great acting, excellent set design that absorbs you back to 1940s Sicily, interesting look at human psychology during wartime, stunning music that got an Oscar nomination as well, and for the role of the mostly silent object of desire there couldn't have possibly been a better choice than Monica Bellucci. In my mind it's among Giuseppe Tornatore's very best work.  The audience rating of this film on IMDB is 7.4 though, therefore I wanted to hear what others consider as flaws or weaknesses in this movie requiring a few points deduction. Could it be because the common version of this movie seen by the English speaking world is butchered by censorship hurting the flow of the story (15% of runtime cut) ? Or are there other weaknesses that I'm missing?",
        "date": "12/20/2022, 18:40:51"
    },
    {
        "title": "What are some films where there's no good guy, everyone sucks?",
        "body": "For example, Far Cry 4 (heavy spoilers). >!You are Ajay Ghale who is being played by everyone in Kyrat. The Golden Path is using you, Willis Huntley is using you, Yogi and Reggie are using you. The only person who isn't using you is Pagan Min who is still a piece of shit. The two leaders of the Golden Path: Amita and Sabal are revealed to be antagonists. The 4 people you have taken out, red herrings. They're bad people, but killing them hasn't done anything good. It's just left a power vacuum for Amita or Sabal to lay seige. Amita wants to turn Kyrat into a drug state whilst forcing children into her army. Sabal wants to go back to tradition, but what this means is becoming a regious zealot and terrorist militia group where anyone who is seen straying from the path is shot on sight. Even yourself, you suck. You have been running around like a headless chicken doing awful things like blowing up religious monuments because you fell for the idea you were making Kyrat a better place.!<",
        "date": "12/20/2022, 18:00:04"
    },
    {
        "title": "What's the Most Bizarre Movie You've Ever Seen?",
        "body": "If you could choose a movie you thought was the weirdest/strangest/most bizarre motion picture to ever grace the screen, what would it be? For me it's probably the 1996 film, *Schizopolis.* Had to watch it for a film class once. It's directed by a guy named Stephen Soderbergh, and I'd describe it as a really artsy interpretive film. I'm sure to the right audience, it's interesting. But for me on the other hand...never been more confused about what's going on in my life.",
        "date": "12/20/2022, 16:47:50"
    },
    {
        "title": "The Invitation",
        "body": "So I haven't seen anything posted about this movie so I don't know if this is actually an unpopular opinion but feel like it might be. During the wedding scene after Evie drinks Wills blood she has this whole plan to save the servant girl and burn everything down and to kill Will. I actually think it would've been a better ending if she drank his blood and was overcome with a bloodthirst so powerful that she couldn't help but kill the servant girl and the transformation to vampire actually made her enjoy it. The ending could've been Will and his 3 wives sitting together and planning their rule for the next 100 years. Idk I just feel like it would've been a better twist on a typical predictable horror movie. Opinions?",
        "date": "12/20/2022, 16:43:52"
    },
    {
        "title": "The first half-hour of Halloween Kills is near-perfect Halloween",
        "body": "Those first thirty minutes of this movie is nearly perfect. You have the opening which shows Hawkins is still alive but unfortunately sidelined for the rest of the trilogy, given he was one of the best characters of H40, and you get a kickass flashback from 40 years ago, showing the motivation that Hawkins has to take down Michael himself.   You get introduced to potentially cool characters, namely the legacy characters from the first movie, as they are gathered to celebrate their surviving Michael's wrath decades prior.   We are then brought to the inferno that was Laurie's house, firemen arrive, Michael opens that sliding door to reveal himself, then he slaughters them all in super cool ways and I do wish we got to see him kill them all.....  Then we see him go to that old couple and he kills the husband, nearly kills the wife but she survives as seen in Ends of course.....  After this the movie only goes from bad to worse, suffering from really bad writing, characters being total dumbasses, cringey Shakespearean dialogue, severe lack of logic all over, and the ending being completely meaningless given everything that happens in Ends. Plus.....they fucked that mob mentality subplot up all to hell because of the actor they went with for that.....the Penguin, instead of someone who could pass for James Jude Courtney's stunt double or something.   It's a massive disappointment and ruins potential for a super kickass Halloween/Michael Myers movie",
        "date": "12/20/2022, 16:26:33"
    },
    {
        "title": "suggestions for Christmas movies?",
        "body": "need some feel good Christmas movie recommendations to binge watch on the night of 25th. Anything with cheery, magical, festive or winter-esque vibes :)  Which are some of your favourite Christmas movies? That you relate to your own culture and traditions with? Or the ones with whom you have some associated nostalgic memories with, while growing up?  feel free to suggest from any genre/style/language or platform. Thank you in advance!",
        "date": "12/20/2022, 15:59:35"
    },
    {
        "title": "What are the modern classics?",
        "body": "When I think of the era I grew up in (the 90's) movies like Forest Gump, Shawshank Redemption, Braveheart, Pulp Fiction, etc., felt so timeless and classic. Those were some of the movies that everyone agreed were great, and films that mostly kept their sense of importance to us as we've aged.  For my parents it was movies like The Godfather, Jaws, Star Wars, etc.  For kids/younger folks growing up in this era, what are the classics? What movies will people look back on as the crucial films of this time era?",
        "date": "12/20/2022, 15:50:51"
    },
    {
        "title": "Who is the worst prolific actor in big budget, or otherwise mainstream films?",
        "body": "I saw the *actor better than Christian Bale* thread, and it got me thinking about the worst actors. Not the schlub in some soap commercial, or the extra who was given a line, the terrible actors who for some ungodly reason keep getting parts? For me, I have to say Jon Goodman. Never really acts, just reads lines, and the last thing I saw him in was playing an actual thumb, which felt like pretty solid typecasting.   Even if you like them as a person, whose acting chops just aren't up to snuff?",
        "date": "12/20/2022, 15:39:08"
    },
    {
        "title": "What are some of your least favourite story beats? I'll start..",
        "body": "Revenge never brings you any peace/Revenge isn't worth it. This is an overused trope that's rarely ever done right. The only movie I can think of which did this somewhat effectively is I Saw The Devil.  It's also somewhat untrue. While forgiveness and mercy should be the general rule and is most of the time the better thing to do, revenge with justice does bring its own sort of solace/closure.",
        "date": "12/20/2022, 15:34:33"
    },
    {
        "title": "Which specific line of dialogue is your *MOST* favorite one, from KILL BILL and KILL BILL Vol. 2?",
        "body": "...and by MOST FAVORITE, I mean- the specific way the line is delivered by the actor, or \\*how\\* the line originated, or what will it lead to, once the actor has delivered the line? Is the end-result of the spoken line the specific REASON it's your favorite movie line?      (here's an example; I hope that I am.. (at least, somewhat)... making sense of mostly everything by describing the origins of this question, but: once your favorite line has been delivered, what is the end result? (once the line itself has been delivered..) Which line of dialogue is your favorite? and WHY is it your favorite line?",
        "date": "12/20/2022, 15:20:38"
    },
    {
        "title": "Just wanna say the score for Transformers 3 is incredible.",
        "body": "Sadly it isnt available on any music streaming platform for some dumb fucking reason. Luckily I downloaded a high quality copy many years ago.  Steve Jablonsky is such a underrated fantastic composer. I think besides Junkie XL, he's the best to come out of the Hans Zimmer school. Personally I think Lorne Balfe is kinda weak.   There Is No Plan, I Promise, It's Our Fight, The Fight Will Be Your Own. All from TF3. Downright incredible tracks from Jablonksy.   Wish he'd do more stuff.",
        "date": "12/20/2022, 15:15:34"
    },
    {
        "title": "Need recommendations for sci-fi movies similar to these",
        "body": "I don't know how to categorise this, but are there any other Sci-Fi movies where the sci-fi bits are very otherworldly and mysterious? These are some of the recent ones that I really love:  - The Thing - Event horizon - Time trap - Cube - Hellraiser - The Platform - In The Tall Grass - Nope - Circle - Annihilation  I prefer something that is not too action-ish and not too slow-burn-ish",
        "date": "12/20/2022, 14:47:09"
    },
    {
        "title": "Can't find a character!",
        "body": " I'm trying to think of a movie character but don't remember much or what movie it might be from. He wears a blue suit, brown sweeping hair, may be a salesman, and has mannerisms that may be similar to Uncle Rico from Napoleon Dynamite. May or may not be mustachioed, may wear a gold chain around his neck and sit at a desk at some point throughout the film. I've been searching online but am nowhere close to finding him. It's not anchor man, please help if you can!",
        "date": "12/20/2022, 14:46:23"
    },
    {
        "title": "What movies badly butchered a great book?",
        "body": "I've been on an audiobook binge recently and I figure this is a great time to clean my bucket list of all the times I've heard people say the book was so much better!.  Recently I've gotten through: Hunger Games, The Time Machine, To Kill a Mockingbird, Gone with the Wind, Jurassic Park and Dune.   Next on my list is World War Z, which was brought to my attention from reading comments on this subreddit. What other suggestions should I look into?",
        "date": "12/20/2022, 14:38:43"
    },
    {
        "title": "What are your favorite Guilty Pleasure movies?",
        "body": "You know the ones, movies that by all reasonable measure you should hate and revile but you secretly watch whenever it's on. The more hypocritical it makes you feel, the better. One of mine is the 1998 Matthew Broderick Godzilla movie (I know, I know, but to be fair it's mostly because of Jean Reno...)",
        "date": "12/20/2022, 14:35:56"
    },
    {
        "title": "Spike Lee should make a film about the Greensboro Sit-ins",
        "body": "Coming off of Lee's films like Do The Right Thing, Malcolm X, and BlacKkKlansman, I started to think about other major historical events that haven't been adapted to historical dramas that he might be a good fit for. When I did, the story of the Greensboro Sit-ins came to mind.  Normally I'd give a long explanation giving my reasons for this, being the relevancy of the Greensboro Sit-ins to the Civil Rights movement, the ways that these events are relavant today, why these events fit Lee's directing style perfectly, and the fact that two of the Greensboro Four are still alive leaves a critical window for getting firsthand accounts of the acts.  Though I won't go into detail about that. I'd like to hear all of your thoughts about this idea, and feel free to back up any of the general ideas above.",
        "date": "12/20/2022, 13:29:09"
    },
    {
        "title": "Movie about a family with a cannibalistic handicapped son",
        "body": "So let me get straight to the point, I remember going to blockbuster as a kid back in '09/10 and remember my stepfather renting out this movie. To this day it has to be the most weirdest movie I have ever seen. The plot goes like this, guy ends up stuck in the middle of nowhere due to a car malfunction, he goes to the nearest house and is welcomed by a family. FROM WHAT I REMEMBER, the family are weird as shit and keep a handicapped son in the basement who likes to feed on human flesh. THIS IS ALL I REMEMBER, and I've tried to find this movie by searching on google countless times and the only movie that sort of resembles what I'm talking about is The Hills Have Eyes, and even then that movie doesn't come close. Somebody please help, I know the description of the plot is extremely vague but it's all I remember as a kid.    EDIT: I HAVE $25 FOR ANYBODY THAT GETS IT. IM SO DESPERATE AT THIS POINT",
        "date": "12/20/2022, 13:20:16"
    },
    {
        "title": "Who is the best one-note actor?",
        "body": "Tom Cruise, Dwayne Johnson, Arnold Schwarzenegger, and Sean Connery all have great films and performances in their catalogues, but I really don't recall them stepping out of the comfort zones, in which they basically play themselves. Who is the best actor that always plays themself, or doesn't have much in the way of range? Keanu Reeves also feels like a shout in this category, and I \\*love\\* loads of his movies.  This isn't a criticism of them as actors, people, or a slight on the films they're in - just a comment on their characters being very much like them as actors.",
        "date": "12/20/2022, 12:54:36"
    },
    {
        "title": "top 5 enjoyable movies",
        "body": "Movies that are fun, enjoyable, and reasonably safe picks where everyone will go huh that was a good time. Nothing to heavy, pretentious, or controversial.    An example top 10 in no particular order:  1. Knives out 2. Edge of tomorrow  3. Train busan 4. Ground hog day 5. The raid redemption  6. Superbad 7. Fargo 8. Shaun of the dead 9. Juno 10. Trumen show",
        "date": "12/20/2022, 12:54:34"
    },
    {
        "title": "Best Stephen Chow movies?",
        "body": "Best known in the west  for Kung Fu Hustle & Shaolin Soccer. I personally think his most comedic movies were from the 90's where he was pumping them out left and right.. Although his most recent directorial 2010 movies were good too. My favorites are:  1. God of Cookery 2. Hail the Judge 3. Flirting Scholar 4. King of Beggars 5. Journey to the West",
        "date": "12/20/2022, 12:35:53"
    },
    {
        "title": "What's your favourite Rom-Com Christmas movie?",
        "body": "With the festive season around the corner, the people I spend time with tend to watch typically bad Rom-Com Christmas movies. It's all in good fun because you can just chat your way through it, but I'm in the mood for something a little better than bad this year.  Does anyone have any recommendations for rom-com Christmas movies that YOU consider good? That way once Netflix pops open we can choose a movie that I can sit through and actually enjoy for its movie quality and not just the banter that ensues from it.  **We've already seen Love Actually and The Holiday.**  They can be the so bad they're good again types or just genuinely good. I don't mind if it's campy (it's a Christmas movie after all), but I just want something actually interesting!",
        "date": "12/20/2022, 12:17:57"
    },
    {
        "title": "Destroying cursed/evil artifact scenes",
        "body": "I'm specifically thinking about the LOtR “cast it into the fire. destroy it” but my brain must be buffering because I can't think of a single other example of this trope.    I'd even take any somewhat related tropes, like when someone is killed for knowing too much or killed in the middle of revealing/confessing secrets or classified information.    The only examples I could find on tvtropes were kind of obscure, and I know there are more popular instances of all this stuff.    I'm going to ask the TV sub as well, but I feel like there are likely more of these plot lines in movies.   There must be other direct examples of this trope, right?",
        "date": "12/20/2022, 12:04:10"
    },
    {
        "title": "Is there a better actor than Christian Bale right now?",
        "body": "I was just watching the new Thor movie, and while it is extremely mediocre, Christian Bale absolutely killed it in his role. This got me thinking that I can't really think of an actor who is better than him. Any other actor I can think of is Oh it's just the actor playing him/herself in a new role, but with Bale he really transforms into the character.",
        "date": "12/20/2022, 11:39:57"
    },
    {
        "title": "What is the single most popular and influential film of all time?",
        "body": "Many people would probably say films like citizen kane,the godfather part 2 etc . Obviously they are the top contenders but there are heavily pop culturally famous films like titanic.Its your choice after all guys.What film do you think is the single most popular film of all time.It can be from any decade any year,colour or black and white anything.",
        "date": "12/20/2022, 11:28:06"
    },
    {
        "title": "Don't Worry Darling has a really intriguing premise that completely falls apart with the execution and screenplay for this movie. This is a disastrous follow-up to the really good Booksmart for Olivia Wilde.",
        "body": " The premise for this movie and the actual twist is really, really smart. Whether you agree with the message or the politics I do think making Jack this good-looking provider of a husband in the VR world and then him being this incel scruffy-looking dude in the real world is a really interesting concept and it juxtaposes Florence pugh being the dependent housewive in the VR world and her being this successful person in the medical field in real life and how both dynamics influence both of their perspectives. I do think there's a really interesting movie here that in the hands of a better director and writer would've done wonders. Also, there are small plot holes that make no sense. This program works by scanning your retina so how would you die in real life from dying in the VR world? Also how the hell is she going to survive when she's strapped to her bed like that?",
        "date": "12/20/2022, 11:09:13"
    },
    {
        "title": "What are your favorite movie continuations of T.V. shows?",
        "body": "I really like the even numbered installments of the TOS Star Trek movies--Wrath Of Khan is one of my favorite films ever made. The odd numbered installments always felt like extended episodes of the television series.  I liked Star Trek:First Contact.  I quite liked the 1st X Files movie. The film was my introduction to X Files & I thought the filmmakers  did a good job telling a self contained story--especially given the fact that the film was tied to the shows mytharc.  I thought Deadwood:The Movie was excellent.  Beavis & Butt-Head Do The Universe was hilarious. The scene where Beavis & Butthead go to a gender studies class is easily one of my top 5 funniest B&B moments.  Wayne's World is easily one of the funniest comedies of the 90s.  Do you have any favorites?   &#x200B;",
        "date": "12/20/2022, 11:06:07"
    },
    {
        "title": "If these movies were the six nominees for best picture one year, how good would that year have been?",
        "body": "•127 Hours (2010)  •Brokeback Mountain (2005)  •The Departed (2006)  •Downfall (2004)  •Little Miss Sunshine (2006)  •Parasite (2019)  Would you consider this to be an average year, good year or great year in terms of film? This is a completely pointless discussion i was having with a buddy earlier and i want to see what others think",
        "date": "12/20/2022, 10:57:53"
    },
    {
        "title": "Do film prices differ between buying online and buying inperson?",
        "body": "I am trying to figure out which is cheaper, going to a Kerasotes theater and buying a ticket, or buying the ticket online (their website links through fandango) and they add a convenience fee that is 27% of the ticket price. The ticket price is $7.   Same question with AMC, ticket price is \\~11 online, but they add a 18% convenience fee. Can I just pay the $11 in person? Or will it be significantly higher in person?",
        "date": "12/20/2022, 10:53:05"
    },
    {
        "title": "What horror movie do you think has build up/s that are infinitely scarier than the payoff/s?",
        "body": "Mine is probably the first Insidious film. I know a lot of people like this film's climax but I'm sorry, it just never clicked with me. Which is a shame because I absolutely loved the film's setup and buildup. It's so brilliantly haunting and atmospheric. James Wan sure knows how to do atmosphere. The Tiptoe Through the Tulips? Awesome. The part where Elise describes what the demon looks like through a sketch? Chilling. The astral planes explanations? Honestly pretty original for what I assumed would just be a standard haunted house movie.  But man, I just felt really letdown by the CGI infested, makeup heavy, and effects reliant third act. The one thing that did get me was that ending. But even then, that over-the-top, echoey gasp from Renai always kinda made me laugh for some reason.  It's just a really disappointing climax for me.  What film was like that for you?",
        "date": "12/20/2022, 10:51:08"
    },
    {
        "title": "Bad Santa is one of my favorite Christmas movies of all time.",
        "body": "So I rewatched Bad Santa tonight as part of my yearly tradition of watching Christmas movies leading up to the big day, and it is awesome, it is, in my opinion, one of best and most funniest Christmas movies ever made, and, as can be guess, still holds up extremely well.  For many reasons, such as Billy Bob Thortons performance, his characters dynamic with the kid being very well done and believable, the kid himself, whole you could argue can be alittle bit annoying at times, still very sincere and still feels like a realistic portrayal of a kid, and his nonchalant reactions to Willys outburst are just hilarious, to the other characters also being very memorable, to the comedy just being so funny, like, I was laughing like crazy throughout the film.  But I think the reason I move it the most, is that despite it being a very un-convential Christmas movie, it actually has a very positive and feel good message. Yes it does have raunchier humor and darker moments, but at its core it still has a great message about not being alone, Bonding with others, and changing for the better. It's kindof like an R-rated version of the Grinch, actually. So despite being a Un-Convential Christmas film, still manages to also feel like a traditional Christmas film simultaneously as well. Also, it's just a really funny movie. My favorite scenes being with the kid with the ice cream, his freak out in the food court, and the scene of him driving the kid back home.   So yeah, great movie, easily one of the funniest Christmas movies of all time, but also one of my top 5 most favorite/best Christmas/holiday movies of all time. I couldn't recommend it enough.",
        "date": "12/20/2022, 10:39:17"
    },
    {
        "title": "Have you ever seen a movie with a great script, but awful direction?",
        "body": "They usually don't combine like that.  I just watched Infernal Affairs and it was disorienting. The script is very good, but the direction actively hindered my ability to be affected by the characters' plight. The camera moves without reason and slow motion shots / melodramatic music jars you in moments that would otherwise be impacting. Every time I was being pulled into the film, the director would do some unnecessary and unenjoyable stylistic flourish that pulled me out and reminded me I was watching a movie.  Awhile ago I watched a movie, based on a play, that entirely takes place at a police station as a black mother and her white detective husband grapple with the news that their son has been killed by cops. I was continually distracted because the director could not just plant the camera and let the actors convey, reserving the camera movement for when it would be most powerful tool. Instead, the camera was constantly tracking in, out and laterally for absolutely no reason whatsoever. Camera movements convey meaning and, when a director is aware of how the camera motion will affect the audience, can be used to greatly enhance the viewer's experience: random camera movements do the opposite.  Anyways, I thought I'd vent and get downvoted. Can you think of any movies with great scripts and bad direction?",
        "date": "12/20/2022, 10:21:42"
    },
    {
        "title": "FYI… If you want to watch The Muppets Christmas Carol on Disney+ with “When Love Is Gone” you must go to the extras tab and select the Full Length Version.",
        "body": "I have only ever watched the movie on VHS and had no idea it was not included in the theatrical release. Frankly, the scene doesn't even work without the song. Scrooge doesn't even seem that sad in the theatrical version, but in the full length version by the end of the song he's utterly heartbroken.",
        "date": "12/20/2022, 10:19:52"
    },
    {
        "title": "Is the OG Jurassic Park about butts?",
        "body": "My friends and I host a yearly holiday called Dinomas and we watch the Jurassic Park movies and make a Dino craft.  Since we watched the movie  a lot something has become clear. There is a lot of butt shots.  Like a lot.  More then you think.    Our fave game is to call out Butt! when you see a “butt shot.”   Has anyone else noticed?",
        "date": "12/20/2022, 10:16:57"
    },
    {
        "title": "What is the best legacy sequel?",
        "body": "I made a post a while ago about what films should get a legacy sequel, and now I would like to know what existing legacy sequel is the best. Top Gun Maverick is an obvious choice, but 2022s Scream was good, The Color of Money is a classic, The Force Awakens is a crowd pleaser, and Tron Legacy was awesome. In your eyes, whats the best legacy sequel? And whats your reasoning?",
        "date": "12/20/2022, 10:01:28"
    },
    {
        "title": "Night at the Museum is such a good movie???",
        "body": "I haven't seen it in YEARS, but just saw it on Disney+ and decided to watch. It was one of my favorite movies as a kid, and watching as an adult I'm honestly having so much fun. Ben Stiller is incredibly fun, Owen Wilson as well, and of course Robin Williams steals the show. The fx are really great as well, plus I'm just really impressed with all the attention to detail in each historical period, I can't imagine the work and diligence that must've been put into making this. It's great!!!",
        "date": "12/20/2022, 09:46:49"
    },
    {
        "title": "What are two movies that are unrelated, but in your mind they are connected and exist in the same world?",
        "body": "The films Paris, Texas and Sky have always been linked for me. I have always thought that Travis's son Hunter in Paris, Texas grows up to be Diego in Sky. He ends up with Romy because he finds her in a similar lifestyle that his mom probably raised him in and that's all he knows.   Anyone have any other movies that you feel are connected?",
        "date": "12/20/2022, 09:35:40"
    },
    {
        "title": "Which terrible movie somehow got nominated for Best Picture?",
        "body": "Bohemian Rhapsody was dull, historically inaccurate to the actual events, and had bad editing but somehow it wins the Golden Globe and gets multiple Oscar nominations including Best Picture. What's another example of a movie you think is terrible that for some reason gets nominated for tons of Oscars including Best Picture.",
        "date": "12/20/2022, 09:33:55"
    },
    {
        "title": "The Banshees of Inisherin. What just happened?",
        "body": "For some reason, despite seeing McDonagh's other films, I was expecting something more calm. I don't know why exactly. I saw the trailer months ago, and it seemed like a comedy/drama with some odd elements. Holy crap. I wasn't expecting that.  No spoilers, but it gets rowdy and dark.  I loved the movie. I cried at least twice in the first half.   Then... well it changes.",
        "date": "12/20/2022, 09:31:06"
    },
    {
        "title": "Is “A Few Good Men” worth watching despite knowing the ending?",
        "body": "I've re-watched the court scene with Tom Cruise and Jack Nicholson so many times on YouTube and never get bored… Despite never seeing or knowing anything about the movie other than the fact that some guy named Santiego dies.  I quote “YOU CANT HANDLE THE TRUTH!” Every month without even knowing what it means lol   Comes to show how good of a job Jack Nicholson did in this movie (or at least that one scene).",
        "date": "12/20/2022, 09:19:03"
    },
    {
        "title": "Do you think Bruce Campbell is a 🦚 actor who should be regarded as well as Meryl Streep and Idris Alba?",
        "body": "Let's be honest. The man exudes charisma. He is charming, he is cynical, he is handsome, he is both a comedic actor and a phenomenal physical actor. He does most of his own stunts which have resulted in many physical injuries, he has a smart wit, sarcastic cense of humor, and allegedly paid over 1k to help fly a fan out to a convention so the fan could meet him.  His work in Evil Dead is unparalleled, his television shows are classics, and his self produced works are beautifully insane and entertaining as hell. I truly do consider him one of the most entertaiing actors we have and do hope to see him continue his great work for many more years to come.",
        "date": "12/20/2022, 09:05:51"
    },
    {
        "title": "Any good movie recommendations from 80s, 90s or 2000s?",
        "body": "Does anybody have any movies that they like, or even tv shows from 1980-2010 that they would like to recommends? I don't like movies that are made after 2015 aside from the ones everyone has already watched. Please comment some of your faves, especially ones that aren't as known/popular, but you still think are really good.   Edited to piss a bit less people off. My sincere apologies.",
        "date": "12/20/2022, 09:03:42"
    },
    {
        "title": "What was your favourite movie going experience?",
        "body": "I'm not talking about favourite film necessarily, but an experience at a theatre that was most enjoyable/memorable.  Mine was going with a few other guys to opening night of Snakes on a Plane. The crowd was having a great time, yelling stuff out during the film and giving the plane landing a standing ovation. But the cherry on top was one of the guys I went with brought in some beer, and if you're a Canadian you'd understand, a Swiss Chalet quarter chicken dinner. He ate the whole dinner and about halfway through the movie, one of his empties fell over and rolled and clinked down the entire height of the theatre.",
        "date": "12/20/2022, 08:53:47"
    },
    {
        "title": "What movies do a powerful job of immersing the audience in their world with the dialogue?",
        "body": "Rewatched *True Grit* the other night and the banter is so perfect. There are westerns like *Tombstone* that sell the swagger of everyone just right, but Grit is its own thing with the way the cadence & diction make you feel like you're seeing something really happen during that time period. While the cinematography is great as is the action, the words in between and during & their delivery by everyone from the main characters to one-offs are what make it such a strong film.  *Snatch* does the same with pretty much every role. I don't know that every single accent is accurate, but the way it's sold makes the audience feel like they must be and almost everything that's said helps drive the film rather than just filling up time.   *Nightcrawler*, *Michael Clayton*, and *Wind River* would be some others that come to mind where in spite of physical action and constant rising tension from the plots themselves, the dialogue serves as the strongest feature to establish characters, the world, the mood, the danger, and so on.   What are some others?",
        "date": "12/20/2022, 08:53:29"
    },
    {
        "title": "Which roles should have been played by different actors if they hadn't died before their time?",
        "body": "Originally I wondered what the community would have liked to see Heath Ledger do after The Dark Knight but decided to expand it to imagine alternate worlds where these tragedies didn't happen. What roles might have been for the likes of Heath Ledger, Brittany Murphy, Anton Yelchin, James Dean, River Phoenix, or others who went too soon?",
        "date": "12/20/2022, 08:51:45"
    },
    {
        "title": "Sleepless in Seattle is so creepy",
        "body": "My mom just made me watch it and the whole time i felt disturbed by it, it's more of a stalker movie than a romance. If the actor who played Annie wasn't attractive it would be a completely different story. It's like the danny devito rule how if the actor could be replaced with danny devito in a romance movie and still work then its good but if not then its bad.",
        "date": "12/20/2022, 08:47:51"
    },
    {
        "title": "Megamind is one of the best movies I have ever seen!",
        "body": "I know I'm a little late. I never really bothered because I thought it was just a meme. But I finally watched it today and it was amazing! The movie felt so relatable, being dealt the bad hand in life. But turning it around and making it good for yourself, evil or bad. I had a blast watching it, one of the best movies I have watched in a very long time. I honestly would give it a 10/10, I have no problems with it. Props to the people who made it! Masterpiece!",
        "date": "12/20/2022, 08:45:08"
    },
    {
        "title": "What is your favorite version of A Christmas Carol?",
        "body": "I just realized there are so many good adaptations of this classic Charles Dickens tale, including versions by the Muppets, Bill Murray Albert Finney, and Jim Carrey.  My favorite is from 1999, with Patrick Stewart as Scrooge. I've always been a big fan of his, and as a teen I was so excited when this was first released.   So now I'm curious....which one is your favorite and why?",
        "date": "12/20/2022, 08:15:54"
    },
    {
        "title": "What movie is actually better in a lower quality format?",
        "body": "Example, The Blair Witch Project.  The low quality makes the film look like found footage, and the low quality makes the movie more immersive.  But something like Titanic, or The Ten Commandments, I would argue, are made for higher quality viewings.  But what movies are made for the lower quality medium?",
        "date": "12/20/2022, 07:49:13"
    },
    {
        "title": "Best Movie Trilogy Ever Made?",
        "body": "Recently had a debate about this with my family. What in your opinion is the best movie trilogy ever made? Top contenders for me would have to be the original Star Wars trilogy, the Christopher Nolan Batman trilogy, and of course the Lord of the Rings trilogy.  I'll probably end up watching or re-watching whatever the top comment ends up being.",
        "date": "12/20/2022, 07:47:57"
    },
    {
        "title": "A Walk to Remember ( 2002 )",
        "body": "really good Romance genre movie with a good Christian theme.  A Walk to Remember . About this troublesome rebellious teen name Landon who was put in community service at school to avoid being expelled and met this Reverend's daughter Jamie (A goody two shoe Christian who's NOT popular) who helped influenced and change his life to become a better person.      I really liked Landon's character development in this movie. How he went from an immature troubled teen into a mature grown young man and how he learns about respect with the confrontation with the Reverend/Pastor and earning his TRUST throughout the movie. It's a nice film how the love of someone can definitely change someone's heart.",
        "date": "12/20/2022, 07:19:44"
    },
    {
        "title": "What defines a movie being “made for the big screen”",
        "body": "Glass Onion is coming out streaming soon so I was thinking back to reviews I saw of it. I remember one YouTuber who went to the film festival it premiered in—I forget who—said that Rian Johnson promoted the movie by saying that it was meant to be seen in theaters, and that the reviewer disagreed with that. That got me wondering, what makes a theater experience essential for some films.  It's not like that this is an underdeveloped idea. Using another film from this year, I saw countless number of people saying that Top Gun: Maverick was meant to be seen in theaters. I watched it in one and loved it, but I still don't know what makes it more essential than other films on the big screen. There's definitely spectacle that other films don't have, but that seems somewhat subjective at least.  What do you guys consider a film “made for the big screen”?",
        "date": "12/20/2022, 07:05:33"
    },
    {
        "title": "Anyone know what happened to the cgi James Dean movie set to release in 2020?",
        "body": "I remember a few years ago there was a lot of backlash and controversy about the upcoming movie Finding Jack that was being made with a cgi James Dean. A lot of actors came out against the idea and since the lockdowns there hasn't been a single news article about if it was cancelled or still being made.",
        "date": "12/20/2022, 06:40:32"
    },
    {
        "title": "what folklore character needs a current movie?",
        "body": "Growing up I always loved Zorro, and Davy Crockett, even though I know Davy Crockett is a real person, he borders on that folklore line, And there's probably intellectual property problems with Zoro, but those are just my bad examples. I like superhero movies as much as the next guy, and now that all the major characters have been used, it seems like they're just going to fringe characters. And with so many different countries and just here in the States, this so much folklore to mine from that I think would make great movies.",
        "date": "12/20/2022, 06:32:17"
    },
    {
        "title": "Have you ever found a director's choice for his favorite movie that he directed to be surprising?",
        "body": "I think it was on Howard Stern and Quentin Tarantino said that his favorite Tarantino movie was **Once Upon a Time in Hollywood**. I thought he was going to chose **Pulp Fiction** or **Reservoir Dogs**, but his choice did surprise me.  Also, I remember reading that Stanley Kubrick said that **Eyes Wide Shut** was his favorite and once again I thought that was an odd choice. I could be wrong about that one though.",
        "date": "12/20/2022, 06:31:39"
    },
    {
        "title": "Great movie… except for that one scene",
        "body": "It's in the title, but anyone have any good examples of fantastic movies that have like one or two inexplicably bad scenes?  Like, I love Get Him to the Greek (I know most people don't like it and it's mostly been lost to time, but it hits for me) almost entirely, except there's one extremely bizarre scene toward the end where the three main characters attempt a threesome. It's not particularly funny, it adds almost nothing to the story and really feels uncomfortably shoehorned in there.  Anyone else have favorite movies with one or two terrible scenes?",
        "date": "12/20/2022, 06:22:31"
    },
    {
        "title": "What animated movies hold their own with the best of the best movies of all time?",
        "body": "'Up' is one that always pulled on my heartstrings and carries its own weight against some of the best films out there.     'Spirited Away' while very popular, ages very well over time and deserves a watch every year or two.   'Pinocchio' I don't know if this is truly up there with the greats or not, but its a nostalgia for a film I grew up on and the story seems to age well!",
        "date": "12/20/2022, 06:19:18"
    },
    {
        "title": "Which actor(s) did you not expect to become as big as they did?",
        "body": "I didn't expect Zendaya or Jenna Ortega to become as big as they are now. Both started in pretty average Disney shows and neither of them really showed much potential to be big actors in the fufure but now Zendaya is(was) a major character in a Spider-Man franchise, she's starring in Dune, another big movie and she's starting in another pretty popular show, Euphoria. And Jenna Ortega is now starring in one of Netflix's most popular TV shows and is a recurring Horror movie acress.",
        "date": "12/20/2022, 06:18:23"
    },
    {
        "title": "Daniel Stern's scream in Home Alone is the greatest one in cinematic history.",
        "body": "I'm a huge horror fan and there are some phenomenal screams. For starters in Scream. But I keep going back to the tall fro half of The Wet Bandits every time Kevin puts the tarantula on his face. Even Kevin has a great one outside his house when his “killer neighbor” approaches him. But hands down I gotta give it to Daniel Stern. He hits a note not even a “final girl” has ever hit.",
        "date": "12/20/2022, 05:51:33"
    },
    {
        "title": "Which western movie are the standoffs at high noon from?",
        "body": "So i'm in a western hype currently, mostly spaghetti western, but I want to watch American ones too. So I was wondering which movie the stand-off on high noon is from. With the tropes of civilians already hiding inntheir homes and so on. Indiz from Frank Zinnemanns „high noon“ or a John Ford movie or from somewhere else entirely?",
        "date": "12/20/2022, 05:46:06"
    },
    {
        "title": "I can't recommend Goodnight Oppy enough. Go see it if you haven't.",
        "body": "I went in blind but this was such a fantastic movie about the Mars rovers Opportunity and Spirit (and yeah, you'll tear up at the end when the titular Goodnight Oppy happens). It's currently streaming on Prime and probably on all rentable platforms (or get it from your library). The rovers themselves feel like actual people and the effects are done by ILM, so they're great. IMO should be required viewing in all high schools.",
        "date": "12/20/2022, 05:03:17"
    },
    {
        "title": "The Menu and Midsommar: Stalinism and Fascism",
        "body": "Spoilers :   Many people have noted the similarities between these films : a group of outside observers stumble onto a community at which point, with a building sense of dread, they uncover the dark, violent intensions that this group has for them. Both prey on a sense of guilt that is uncovered in the protagonists. Both engage in a violent reaction against consumerist, egotistical modern society. And both , of course, end in fire. However, despite the similarities, I think that the two communities, the Chefs and the Swedish village, represent radically opposite political idealogies: communism and fascism respectively.    Midsommar makes it references to fascism obvious. As soon as the anthropologists land in Sweden there is a huge banner advertising a far right anti-immigrant political party. The community, like fascism, is based in obscure mythical origins and a violent commitment to tradition. And it's appeal (as shown in the infamous crying scene) is based, like fascism, in the sense of community and belonging missing in the modern world.    The Menu is less obvious , but at least clear in the anti -capitalist designs of the chef collective. Ralph Fiennes chef repeatedly calls out how the rich and money pervert his restaurant. The bankers are selfish, corrupt, assholes. One character is labeled guilty just because she was rich enough to not have to take out student loans. The reduction of everyone to simply “chef” instead of their names mirrors the universalizing title of comrade in communism. There is no commitment to tradition, only an ideal. And like Stalinism, and unlike in Midsommar of fascism, the terrifying sense of guilt cannot be escaped, there is no one group that is elevated above the others, and even the chefs themselves carrying out this violence are guilty and have to die.    Some might call this a reach but I think at least the fact that both movies are very political is undeniable.",
        "date": "12/20/2022, 04:57:20"
    },
    {
        "title": "Name a single movie, where the sequel or remake was better than Original.",
        "body": "My girlfriend and I are laying around watching Netflix and got into a sudden discussion about remakes vs originals. We BOTH agree that we can't think of a single movie where the remake was better than the original. This conversation stemmed into a discussion about sequels vs original movies. This too we cannot think of a single sequel that we enjoyed more than an original film. There HAS to be ONE! help us 🤣",
        "date": "12/20/2022, 04:22:38"
    },
    {
        "title": "Comedy movies with cold/desaturated (not black & white) color palettes?",
        "body": "I'm in love with Bruno Delbonnel's cinematography, and I want to watch more movies in his style of dream-like, desaturated look. Of course, many movies in that palette tend to be more in the world of drama. The closest I can think of is Inside Llewyn Davis, but that's more of a dark comedy. I'm thinking more in the vein of rom-coms.",
        "date": "12/20/2022, 04:14:25"
    },
    {
        "title": "What are some highly acclaimed films you can't be bothered to watch and why?",
        "body": "I'm sure we all have a backlog of classic movies we haven't gotten around to watching for whatever reason. What are your huge movie blindspots and why haven't you watched them yet?  For me, I haven't watched any Tarantino film past the Kill Bill films. I think by the time Kill Bill 2 came out, I was all Tarantino'd out. It also seemed like every other film that came out during the early 2000's was trying to ape Tarantino's style. I'm sure if I start digging into my backlog of Tarantino films, I'll rediscover what made me love his films and I'm sure his latest films are all pretty different from one another to make for an exciting marathon. But I find I just don't have the appetite for Tarantino anymore.   One of these days though, I'm sure I'll get to it.",
        "date": "12/20/2022, 03:53:24"
    },
    {
        "title": "What is the movie that has a cow...",
        "body": "My filosophy teacher was going to show us a movie that has a cow, and some people that already watched the movie said that it has a naked woman too (?) (apparently in a field but I'm not sure).   Also, we're studying existencialism, so maybe it has some existencialist vibe.   Idk I'm curious now, I love watching movies.",
        "date": "12/20/2022, 03:50:37"
    },
    {
        "title": "What could you turn into a heist film?",
        "body": "What movie could have really been a heist in disguise?  I'm thinking of those funny trailers of turning kids movies into horror movies, or horror movies into kids movies....but tapping into an film (could be recent or old) that if you peel back the layers could actually be about a heist.  I feel like Frozen could do that, maybe some cult classics Office Space or Ferris Bueller - or even a crazy out there idea of a kids film (smurfs, shrek, etc)  What you you all think would make a good “heist” film plot?!",
        "date": "12/20/2022, 03:38:39"
    },
    {
        "title": "Scenes that hit completely different due to real world circumstances",
        "body": "What are some movie scenes that just hit on a completely different level or feel recontexualized due to something that happened off screen, either before or after filming.   SPOILERS: my biggest has got to be the ending to Alpha Dog. That scene broke me when I first saw it and after Anton's passing it's one I really just can't watch. The slow realization he's about to die and then begging for life is just way too much for me and hit on a whole different level due to the circumstances of his death.   What are some other scenes that fit this?",
        "date": "12/20/2022, 03:38:23"
    },
    {
        "title": "What's some of the movies with incredible plotlines, but film failed miserably because of all wrong reasons apart from plotlime",
        "body": " I'd like know about some movies which have a oneline which gives you an instant wow but is a disaster due to wrong execution or screenplay or casting etc.  Like the movie Daybreakers, The thread of vampire organised society and challenge to live among them was a cool thread, but the movie was a total disappointment   Would love to hear more of these",
        "date": "12/20/2022, 03:29:06"
    },
    {
        "title": "do u think tom cruise is a 🐐 actor that should be in the same convo with Leo, brad, etc or just a good action star",
        "body": "having a debate right now w my friend, I do think he should be in the same conversations as other goats simply off of jerry Maguire, rain man, a few good man, top gun (I just watched today for the first time lol) etc  but some ppl think he's just an action star thanks to the MI series, mummy, knight and day, etc.",
        "date": "12/20/2022, 03:27:35"
    },
    {
        "title": "What classic Film to watch next ?",
        "body": "Just watched 12 Angry men and Rear window, now I'm back down the rabbit hole of classic films and could use some suggestions. I enjoyed them both, 12 angry men was better in my opinion. In my film class a few years back I watches Searchers, Citizen Kane, Vertigo, All About Eve, Maltese Falcon, psycho, and Rashomon. I'm gonna watch Seven Samurai tonight, so I need some suggestions after that. From the above movies I enjoyed Rashomon, Citizen Kane, Searchers, Psycho. I thought Vertigo, Maltese Falcon, and All about Eve were just okay and a bit overrated. Hit me with some, I'm a bit wary of watching classic comedies but if someone has a good one, that an untouched territory for me.   EDIT: Great Suggestions, but no one has recommended “Tampopo” which I just realized more people should watch it, if you guys haven't go please give it a go.",
        "date": "12/20/2022, 03:24:16"
    },
    {
        "title": "With Ke Huy Quan back in the limelight, does anyone think it should have been Short Round to reunite with Indiana Jones in the new movie?",
        "body": "It should have been Short Round in Kingdom of the Crystal Skull instead of that shitty, bio son played by Shia LaBeaver. And I dare say I might feel the same in DIAL.   Say what you will about TEMPLE OF DOOM but the relationship Indians Jones had with Short Round was as close to a father and son bond as we've ever seen. They had great chemistry, a cool bond, they worked together and Short Round respect his adopted dad. It kills me that he was never brought back. It would have been more impatcful to see Short Round grow up as a adventurer and reunite with his friend/father.   Now, we'll never have that. Dial was the last chance for that reunion.",
        "date": "12/20/2022, 03:22:13"
    },
    {
        "title": "Weirdest movie you've watched recently?",
        "body": "  Just watched Mandy. It was the boyfriends pick as part of a recent movie marathon. We watched it all the way through, but I had a hard time sticking this one out. The only thing I can pick out that I liked about it was that Nicolas Cage was awesome in it as usual. Normally I'm a big fan of whatever he is in, but man what a weird one.",
        "date": "12/20/2022, 03:13:56"
    },
    {
        "title": "Sexual mysticism, erotic movies that are quality films?",
        "body": "What are some erotically charged movies that are actually good quality films?(or at least decent). I'm thinking of movies that aren't porn schlock, but have erotic or sexual themes central to it's aesthetic. Sexual mysticism is a term that describes what I'm looking for, where sex and sexuality are held in a mystical kind of fascination. Often resulting in an otherworldly and artistic reverence towards it. Some examples are Eyes Wide Shut(1999), Bram Stoker's Dracula(1992) and Crash(1996). The Trip(1967), could be argued to qualify. Basically horny art... but with a good story.",
        "date": "12/20/2022, 02:46:48"
    },
    {
        "title": "in this generation do you really think Leo's the goat?",
        "body": "The general audience nowadays tend to helm Leo as the goat of this generation but I think he got some competitions in my opinion if u compare his history with others  I think Christian Bale  and Jake Gyllenhaal can match with him  all the roles Leo did, I can see both these actors doing them well...but I can't say the same for Leo, I don't see him pulling off American psycho or batman as good as bale nor donnie Darko as good Jake  Matthew M comes close but not on that level tbh",
        "date": "12/20/2022, 02:35:18"
    },
    {
        "title": "Simple and effective cinematic technique to convey an idea",
        "body": "Or feeling by invoking your senses. For me, it's the scene in Ratatouille where the food critic put food in his mouth and he's brought back to his mama's kitchen when he was a kid, tasting her wonderful food. It's so simple and yet, one can easily relate and know what he's feeling though we may have no idea what that particular dish tastes like.  What is your favourite technique used in a scene?  Edit: I first noticed this technique in God of Cookery by Stephen Chow. This is why he's one of the Goats in my book!",
        "date": "12/20/2022, 02:06:53"
    },
    {
        "title": "I'm looking for some romantic movies about attractive/hot man fall in love with ugly/unattractive woman",
        "body": "In this sub, I just came across a post of  **I'm looking for some romantic movies about attractive girl fall in love with ugly/decent guy**  and I just remembered, I've ALWAYS wanted to watch a good movie where the very desirable man falls in love with a woman which you would least expect, because of her appearance. Or where the unattractive woman is able to conquer the hot man.   I'm genuinely wanting the titles for movies like these! For what I have seen close to wahat I'm asking comes to mind a series (but I'm looking for a movie) called Yo soy Betty, la fea and she really is NOT ugly, they make her look ugly. You can tell.   No kids movie, only high school, college or adults. No explicit porn movies please LOL  &#x200B;  I'm excited!  Movies from all around the world are welcome!!",
        "date": "12/20/2022, 02:06:19"
    },
    {
        "title": "Will Walt Disney Animation Studios ever write and produce a film based on The Strange Case of Dr Jekyll and Mr. Hyde?",
        "body": "What I mean is since the beginning of the history of The Walt Disney Company, WDAS has adapted legends from all eras, and tales from the entire world. But, *The Strange Case of Dr Jekyll and Mr. Hyde* was never completely adapted into an animated film by Disney (I said completely, because Mr. Hyde appears in Touchstone Pictures' *The Nightmare Before Christmas*, but he is a very minor anti-hero, not the protagonist). Also, *Dr Jekyll and Mr. Hyde* is in the public domain (the original book was written by Robert Louis Stevenson, and it was published in January 1886).  I know that, in comparison, *Treasure Planet* (2002, John Musker and Ron Clements) is a pastiche of *Treasure Island* (1883, also Robert Louis Stevenson) in a science-fiction context (a steampunk universe to be exact).  I would really want to watch a political science-fiction horror animated film made by WDAS based on *Dr Jekyll and Mr. Hyde*. It could be the first PG-13 film made by WDAS.  What do you think, folks ?",
        "date": "12/20/2022, 01:58:32"
    },
    {
        "title": "Observation about the Banshees of Inisherin",
        "body": "I just watched the Banshees of Inisherin last night and I had a pretty random observation that I haven't seen remarked upon anywhere. Sam Rockwell has worked with Martin McDonough in his last couple movies. Did anyone else think that the way Colin Farrell was done up in this movie made him look EXACTLY like Sam Rockwell? There were certain points in the movie where you could have told me it was Rockwell and I would have believed it, I really noticed it in the scene where Padraig is drunk and comes into the pub to sound off on Colm. I have no idea if this was done on purpose, or why it even would be, but I just had to put it out there. Anyways, great flick!",
        "date": "12/20/2022, 01:40:50"
    },
    {
        "title": "Directors that took on movies that you didn't expect them to",
        "body": "I was recently taken aback by the news that Minari director Lee Isaac Chung is in talks to helm Twister. Going straight from an indie to the majors is nothing new nowadays, but the tone between the two is so radically different.   That got me thinking about other movie-director pairings that seem like an odd combo. Looking for examples beyond Disney's Marvel output, which has been helmed by a bunch of arthouse directors like Chloe Zhao and Anna Boden/Ryan Fleck.",
        "date": "12/20/2022, 01:31:22"
    },
    {
        "title": "Something you would change in a movie you love ?",
        "body": "For me it would be getting rid of Yub Nub in Return of the Jedi and replace it with the Celebration theme used at the end of the special edition. I love vanilla ROTJ but Yub Nub feels like an end of a weekly episode kids show and the Celebration theme makes you feel the weight of what you witnessed through those movies, makes you look back at the entire experience. Every time i watch ROTJ i stop the movie near the end to watch the scene with the Celebration theme on YouTube (i watch Project 4k83) and i get emotional every time. John Williams, you're a genius  Whats yours?",
        "date": "12/20/2022, 01:17:58"
    },
    {
        "title": "Movie you hated at first but now really like?",
        "body": "Totally stealing the idea of the other post and reversing it, but what is a movie you hated when you watched it the first time and for whatever reason you tried it again and realized how good it was? Perhaps the trailers misled you to what it was actually about, or misled you about the tone of the movie so you expected a lot of laughs and none came, or anything else?",
        "date": "12/20/2022, 00:38:00"
    },
    {
        "title": "Current-Day Cary Grant?",
        "body": "As in the title.  Just scrolling through an article about recent(?) Criterion releases, and Cary Grant's name appeared a couple of times. Which got me to wondering, do we have a current-day/current-generation version of a Cary Grant?  (Of course, I realize that the entire movie industry - as well as our social/cultural landscape - has changed VASTLY in the past 90+ years, and actors are not just pretty faces coming off an assembly line, so it's impossible for a direct analog, but I was just idly wondering.)  EDIT: to be clear, let's think...someone who has been actively acting in the past decade or so.",
        "date": "12/20/2022, 00:25:24"
    },
    {
        "title": "Crime movies suggestions",
        "body": "Ive seen all crime movies from se7en and chinatown and prisoners all the way to 8mm and less mainstream movies also explored the european and asian side if it loved the spanish hated the korean (memories of murder esp) , so id love if you gave me suggestions of good movies and hopfully i havent seen them also id prefer if they were hollywood not european and esp not korean , i dont care if its old or new ive seen movies from the 30s till now 2022 i keep adding text cuz for some reason its not allowed under 300 charachters maybe cuz its  my first post idk",
        "date": "12/20/2022, 00:20:56"
    },
    {
        "title": "One thing that irks me is why the hell hasn't there been a home alone movie is a direct sequel to the first one or two? That follows a grown up Kevin and him having a family of his own?!",
        "body": "What I mean is that a home alone movie following a grown up Kevin McAllister as he accidentally leaves his kid home alone. Like how funny would that be?! Could you imagine what he'd say?! And I'm surprised no one has even tried to make that kind of movie happen since that kind of plot has happened so many times where the kid character from a previous movie is now grown up with a family of their own and goes through the same thing as the previous movie! An example is the recently released a Christmas story Christmas but seriously no one has done this with home alone?!",
        "date": "12/20/2022, 00:08:51"
    },
    {
        "title": "The Muppets Christmas Carol is still the best adaption of this classic tale",
        "body": "At 33 years old, I cannot overstate enough I how much I absolutelly ***adore*** this movie. The amount of love that has been put into every single aspect of it by Brian Henson really shows. When I watched it as a kid, I didn't really know who Michael Caine was, but when I watched it as an adult and realised it was *the* SIR MICHAEL CAINE I was even more awestruck.  It still manages to keep true to the original story, but still also manages to have that classic Muppets feeling to it. The brilliance of having Gonzo as Charles Dickens accompanied by Rizzo.  The songs are beautiful and really strike a chord even when you're an adult. I'll admit that I have cried many a times.  The more I watch films as an adult with the ability to really analyse and critically think about them, it makes you appreciate the art of filmmaking and how much heart goes into a project like this. Especially given how important the Muppets themselves are to us. Not just in American culture (I'm not even American myself), but in general.  I remember how absolutely terrified I used to be of the Ghost of Christmas Future when I was around nine years old.  I don't have or plan on having kids myself, but if you do and if you haven't shown your kids this absolute gem of a movie yet, I really hope you take the time to do so this Christmas.  Some of my personal favourite quotes:  * Light the lamp not the rat! LIGHT THE LAMP NOT THE RAT! * You're on your own, folks. We'll meet you at the finale! * It is the american way! \\*whispers\\* It is the BRITISH way!   Edit to add: it's the best adaptation in *my own* opinion. To each their own  :)",
        "date": "12/20/2022, 00:07:50"
    },
    {
        "title": "what are the movies that encapsulate each genre?",
        "body": "if you were to assign one movie to be the posterchild of a genre (action, comedy, fantasy, romance, horror, thriller, mystery/crime, drama, western, and sci-fi to narrow it down, you can add others if you feel it's necessary) what would they be? the more stereotypical tropes and the less genre mixing there is, the better.",
        "date": "12/19/2022, 23:57:43"
    },
    {
        "title": "I finally watched No Country For Old Men and i dont know why its consider that good",
        "body": "First 1 hour is really good, intense and in pace. Second half protagonist dies kinda off-screen. We dont follow the money anymore. Sheriff story goes to nowhere and i think if it gets cut down from the movie entirely, movie wouldnt lose anything. At the end for a reason someone crashes Anton his car randomly?   Its score is 8.2/10 on IMDB. What didnt i understand of this movie? Am i so wrong?",
        "date": "12/19/2022, 23:56:34"
    },
    {
        "title": "We Were Here (Documentary on the HIV/AIDS pandemic in 1980s San Francisco)",
        "body": "***About me:***   I would preface this review with the simple fact that this documentary and I are by all accounts, not a match. I am straight and have absolutely no interest whatsoever in LGBT issues or films (though I think I saw Brokeback Mountain when it first released and liked it). Some would mistake my disinterest for some underlying homophobia (alongside some other views I might have).  Why would I decide to even go so far as to pay money to watch this? Other than the good reviews on Rotten Tomatoes, this movie offers a unique and concentrated perspective on HIV/AIDS pandemic in the shadow of which many people of my generation, and those from the 80s and 90s grew up (the fear of that generation, heterosexual or not, was tantamount and still is).  The documentary was made in 2011.  I am glad I took that step outside of my comfort zone, and you should too.  ***Synopsis:***  The documentary goes through the early 80s up to the 90s in the Castro, San Francisco's gay district. It does this via interviewing 3 people who witnessed the era: a man with AIDS (in very good health) since 1980s who witnessed it all (and lost 2 partners to it), another man who volunteered for the SHANTI organisation and later was involved in testing,  a nurse who cared for AIDS patients in hospital, a local flower seller.  ***My review:***  The film does an excellent job in capturing the mood pre-pandemic and explain how the community reacted to its onset. One of the 3 witnesses explains for instance the first time he saw a handmade poster with polaroid pictures in the early 1980s from someone with the gay cancer warning other members of community to be careful.   But the movie goes on to offer amazing back in time remembrance of the almost 16 000 people that died of the disease in San Francisco, before the first treatments had been invented (AZT and other cocktails that we have today, that weren't introduced until 1996).  Furthermore, it is a very human story of how many people in that community banded together, not just in activism to push the government and health officials into greater action, but by forming volunteer groups, charity groups to help those dying and to make their time on earth more bearable.  What the movie does not do is fall into a pit of grievance and blame, nor could I see that much blatantly LGBT about this movie that would scare those off who do not usually watch content labelled as such. I saw a series of very human, without any melodrama, recollections that left me slightly moved by the end of it.  I wish it had been slightly longer, and had stuck more to a fixed chronology of the different milestones in terms of treatment innovations. But the vision of the director may have been slightly different.  &#x200B;  I rate: **85/100**  Recommended if you get the chance to see it (I found it on the film's website).",
        "date": "12/19/2022, 23:38:48"
    },
    {
        "title": "Sad romantic movies",
        "body": "Recently watched “Decision to leave” and enjoyed it a lot. Brilliant, lyrical movie, beautifully written and left a good aftertaste. I also appreciated “Bitter Moon” by Polanski, but I have no desire to watch anything done by such people like him. Do you know any sad romantic movies that depict toxic love where the characters fall apart in the end? The sadder the better. Any country is welcomed, I'm a huge fan of foreign movies (especially Korean and French) and animation/anime is welcomed as well. Thank you",
        "date": "12/19/2022, 23:30:11"
    },
    {
        "title": "Great cooking scenes in movies?",
        "body": "What are some of your favorite scenes in movies that involve cooking or preparing food? This can include movies whose focus is cooking or food, but pick one particular scene. Otherwise, I thinking of movies that aren't focused on food but include a memorable cooking or food scene.   For example, the prison cooking scene in Goodfellas. I tend to think of that one when I'm slicing garlic, even though I don't use a razor blade.",
        "date": "12/19/2022, 23:28:51"
    },
    {
        "title": "Animalympics is on Prime",
        "body": "For those of you who love it as much as me, or those who have never seen it, it's a deep seeded childhood classic for me.   The broadcasting characters are so memorable. Oh Gene Hacksaw!   The sports and animals that compete in the Olympic events are so clever. The swimming was my favorite.  My grandma bootlegged me a copy for me off HBO on Betamax.      The original soundtrack by Graham Gouldman of 10cc  is also phenomenal. Upbeat, uplifting, motivational, with some mellow romantic songs that match what the characters are experiencing. If you have this album on LP, that's like gold. I was able to find the soundtrack on YouTube. 42 years later it still slaps.  Enjoy all, I hope a new generation will love it as much as I did.",
        "date": "12/19/2022, 23:19:38"
    },
    {
        "title": "Movies about Dreams and/or Nightmares?",
        "body": "Hello everyone, I'm looking for movies related to dreams and nightmares, in order to inspire me for my own writing that is related to such things.    I'm looking for movies that have a plot relating to an actual dreams or a world of dreams or a person. Bonus if a dream world or Morpheus (God of Dreams) is involved.   I loved Slumberland, and The Sandman (not a movie but series), Little Nemo Adventures in Slumberland, etc   I hope you guys can maybe help me out! I'm open to any genre.",
        "date": "12/19/2022, 23:08:16"
    },
    {
        "title": "What's a movie which is widely panned that you love?",
        "body": "1. Avatar The Last Airbender: Ok. I have seen the cartoon and I watched this movie when I was a kid. I do understand that people have issues with it (Clears Throat) but I loved it. 2. That's My Boy: The movie is crass, problematic and funny as hell(for me). Adam Sandler and Andy Samberg were so funny. I saw Brooklyn Nine-Nine and Palm Springs seeing how good Andy was in this movie. 3. Twilight Breaking Dawn Part 2: This is the best Twilight movie(At least that's what IMDb says). The climax was soo good until it wasn't. Anyways, it was entertaining for me. 4. Transformers 4: This one does not have a story but hey who cares as long as things go Kaboom! Bayhem ultra pro max and that was all I needed. 5. Catwoman: Ok. I know Halle Berry got a Razzie for this but the movie was so funny. I think was meant to be. May be it's not. I don't care, I loved every second of it.  P.S. I've listed some trashy movies I loved. If this post is not for you, please stay away and for the love of God, don't attack me personally.",
        "date": "12/19/2022, 23:03:22"
    },
    {
        "title": "my fav offbeat holiday movies",
        "body": "These are my all time fav's, for Thanksgiving it's The Daytrippers with Parker Posey and a young Liev Schreiber, funny as hell and with Stanley Tucci.  Coming in at number 2 is Hi- life with Daryl Hannah, Eric Stoltz and a funny Peter Riegert. Third is a Bative American classic powwow highway, with Gary Farmer, he us the funniest. Enjoy, and happy holidays.",
        "date": "12/19/2022, 22:42:02"
    },
    {
        "title": "Actors who look/looked older than their actual age",
        "body": "It's common in Hollywood for the actor to play a character much younger than their own age, because of their young looks. Like Leonardo DiCapario, Tom Cruise and Tom Holland, but how about on the flip side? I know Jon Hamm always looked older, I seen a video of him on a dating show in the 90s when he was in is 20s, but he looked at least 40.",
        "date": "12/19/2022, 22:29:24"
    },
    {
        "title": "For those who saw the movie Spring, I have a hypothetical question",
        "body": "So presumedly the ending had Louise still herself, having fallen in love and broke the cycle but is pregnant. Hypothetically, her child will be passed the same curse (in lack of a better word) that she had, and her mother before her had. If her child was a boy, how do you propose the curse would work in regards to how he's affected by it? Under the theoretical assumption that he is, what are some interesting ways to make it work? He obviously can't give birth to himself lmao This is an out there question but what are some thoughts/theories? Would love to hear some creative ideas!",
        "date": "12/19/2022, 22:25:50"
    },
    {
        "title": "Home from work sick, what are good lesser known streaming movies?",
        "body": "Home from work sick and pooping my brains out. Looking for something new to watch. Have Netflix, Hulu, Prime and wouldn't mind renting a movie.  I usually like thriller, sci-if, fantasy or mystery. Also like world war/history movies.  Recently have watched Kingdom of Heaven, All quiet on the Western Front, and Barbarian.",
        "date": "12/19/2022, 22:15:24"
    },
    {
        "title": "Smile ending interpretation",
        "body": "The moment Rose sits on that chair when she's in her old childhood home waiting for the entity to come, she could have probably fallen asleep.   So the whole climax, including passing the curse onto Joel at the end, could have just been another nightmare created by the entity.   If that's the case, then maybe Rose will still return in the possible sequel. Parker Finn did say if he did do a sequel he wanted to subvert people's expectations again, and Rose does still have a few days left.",
        "date": "12/19/2022, 21:53:57"
    },
    {
        "title": "Who or what do you think had the most impact to black culture in cinema recently besides black panther",
        "body": "it could be a director, an actor, a character, a certain film or film franchise, etc.  Who are what made the biggest impact as of recently in cinema for black people.  I personally think it comes to Jordan Peele with his recent films like get out and us (we don't talk about nope)  but I feel like I'm missing someone else",
        "date": "12/19/2022, 21:53:52"
    },
    {
        "title": "Need Sci-Fi Movies with Mind-Bending Twists",
        "body": "I need some movies with epic mind bending twists ....especially Sci-Fi like:-   Tenet   Predestination   Interstellar   Inception     It's totally fine if the genre is not very sci fi but it would be amazing if it has a very major twist or mindbending story. For example:-  Fight club.  I havent watched many movies so you can recommend any movie..................................",
        "date": "12/19/2022, 21:25:10"
    },
    {
        "title": "Christmas Movie Advent Calendar",
        "body": "I've had a Christmas movie advent calendar rolling for the season, and wanted to know if anybody had recommendations for switches and such. Anything goes (I wait until the appropriate age group is put to bed to screen more mature films). There's not a movie for everyday as I want to leave room for watching new releases in theater (e.g. Spirited) and I usually take my family to see the local production of the nutcracker one night.  Charlie Brown/Frosty The Snowman/Classic Grinch  The Polar Express  A Christmas Carol (George Scott)  The Christmas Chronicles  The Santa Clause  Bad Santa  Rise of the Guardians   \\*Gremlins\\*  Love Actually  Krampus  Santa Clause is Coming to Town/Year without a Santa Claus  A Christmas Story  Die Hard  \\*Tangerine Bear/Grandma got run over by a reindeer\\*  Jingle All the Way  \\*Rudolph/Annabelle/Olive\\*   \\*Hallmark Movie Roast Party\\*  The Night Before  Grinch (Illumination)  Elf  Klaus  It's a Wonderful life  Muppet Christmas Carol",
        "date": "12/19/2022, 21:15:19"
    },
    {
        "title": "Movies that are better at being one genre than another",
        "body": "I liked most things about Spirited...except its songs.  I thought most of the ideas it had on what would happen after A Christmas Carol were clever, I liked them delving into the ghost world and how its run as a business, I liked some of the ways they twisted the Christmas Carol formula, Will Ferrell and Ryan Reynolds had decent chemistry and I like how both characters grow over the course of the movie but the songs are weak.  I mean the choreography is good but Ferrell's vocal range just doesn't fit the Broadway show tune style the songs are going for; he's so flat. Octavia Spencer is flat as well. Reynolds is a bit better but he's not great. And Patrick Page, the only professional singer of the cast, barely gets the chance to sing and is cast as the character who is actually trying to stop people from singing.  Also most of the songs sound so...samey and generic. And the songs kind of overtake the movie; there are sections of the movie that are just songs, then long stretches where no singing happens, and then back to song to song back to back.  I kinda wish they just made it a straight out comedy, a sort of modern day Scrooged, rather than just making it a musical honestly.",
        "date": "12/19/2022, 21:09:33"
    },
    {
        "title": "What's a good Christmas romance even men can enjoy?",
        "body": "Its that time of year again were Hallwark and Vanessa Hudgens make the big bucks and holidays romcoms flood in. Clique plots and adults acting like  dumb teens   One can only watch love actually so many time I need some decent films for me and the GF. Please send me the good stuff. No tragedies please",
        "date": "12/19/2022, 21:03:44"
    },
    {
        "title": "What is the timeline of Johnny favorite's actions in Angel Heart(1987)",
        "body": "So I think I understood what happened but just can't put together the sequence of Johnny favorite's actions in a chronological manner. Here's what  happened  Johnny favorite made a deal with Satan to make him famous in exchange of his soul, He got famous and now he wanted escape his fate, he captured and killed a soldier named harry angel and took his memories and soul with black magic, he was drafted and while in battle he was severely injured and his face was disfigured, he returned an amnesiac and was hospitalized in a mental facility, his face was later restructured, Margaret and eathan krusemark bribed the doctor and took him to time square where he disappeared, we later meet him as Harry Angel.   Can somebody put the events I've written in a chronological manner? Feel free to add anything I might have missed.",
        "date": "12/19/2022, 21:01:10"
    },
    {
        "title": "2010s- What is your fav movie and the one you consider to be the best from this decade?",
        "body": "Thought this would be fun because I often see the two conflated on here.  1) Your fav is your fav, what are you going to throw on or endlessly bring up in conversation/it inspires you the most. 2) Best is SOOOO subjective, but what movie from this past decade do you consider the most accomplished by whatever metric you deem it so?  There are no right answers, this is all for fun! If we get a good thread rolling here, I'll do another one for a different decade.   Mine:  Fav- Ex Machina  Best- Moonlight  edit: Im seeing people enter only 1 answer, there should be 2 unless you think your 1 answer covers both categories. If that's the case, specify that :)",
        "date": "12/19/2022, 20:54:44"
    },
    {
        "title": "What's a sadder movie than a requiem for a dream?",
        "body": "(BTW the caption wasn't a beginning of a joke but a genuine question) I feel like i'll never be able to cry bc of a film ever again since i saw a requiem for a dream😭 it was the saddest thing i've ever seen and after seeing it i literally cried in my mom's arms XD I watched eternal sunshine of a spotless mind and i shed a few tears but it wasn't nearly as sad as requiem for a dream. I know it's like everyone's personal experience but i lowkey feel like it's the saddest film on earth. Also I need a new film to talk about, i could talk about it for hours.  Some suggestions this post got in the comments(for anyone who wants to see depressing films too): - Dancer in the dark  - Manchester by the sea - Come and see (1985) - Grave of the fireflies  - Green mile - Breaking the waves - bicycle thieves - Up - Trainspotting - Blue valentine - multiple movies about sad dog stories but it would take way too long to write all here😭 - The butterfly effect - Transformers - My girl - Life is beautiful - What dreams may come true",
        "date": "12/19/2022, 20:44:01"
    },
    {
        "title": "Cronenberg's “Crimes of the Future” anyone?",
        "body": "Just watched it and am shocked nobody is talking about. It really does feel like classic cronenberg. It made me squirm just like his other films, but it also had a pretty unique shocking story and some really nice cinematography. Did anyone even see this? It's nowhere to be found on either r/movies or r/horror   Viggo really did a good job too. Kristen Stewart is extremely weird but the bond chick is great. I wouldn't say it's pure horror I guess sci fi too like dead ringers.  Anyone?? This is cronenberg we're talking about . Ps this game out last year   I got it at a 7.5/10",
        "date": "12/19/2022, 20:41:45"
    },
    {
        "title": "American Psycho is highly overrated",
        "body": " I watched American Psycho about 10 years ago before it was even a thing, i gave it 5.5/10 rating, nowadays people literally made it the greatest movie of all time. Like isn't it overrated? Like there is much better and greater movies then American Psycho. American Psycho is just a movie about a psychopath who kills random innocent people, hide their bodies, and continues living his luxurious life.  What i liked about it its the aesthetics and cinematography. Who else thinks that its overrated?  P.S all stuff wrote above is my personal opinion.",
        "date": "12/19/2022, 20:36:03"
    },
    {
        "title": "Question about batman vs. superman!",
        "body": "it was about the scene when lex told superman that he kidnapped his mom and other things blah blah blah, and if he wants to see his mother alive he must fight with batman!   now, why did superman listen to lex anyway? like, doesn't he has super hearing, x ray vision etc.? he can just save his mother with the snap of his finger, just like that! he did the same thing with his girlfriend in the begining of the movie. Like, he can't be killed by nuke, so why did he care about lex kidnapping his mother?",
        "date": "12/19/2022, 20:23:20"
    },
    {
        "title": "Who's your favorite Clint Eastwood's Western movie from this list?",
        "body": "- A Fistful of Dollars (1964) Dollar Trilogy  - For a Few Dollars More (1965) Dollar Trilogy  - The Good, The Bad, and the Ugly (1966) Dollar Trilogy  - Hang 'Em High (1968)  - Paint Your Wagon (1969)  - Two Mules for Sister Sara (1970)  - High Plains Drifter (1973)  - The Outlaw Josey Wales (1976)  - Pale Rider (1985)  - Unforgiven (1992)  So, what is your favorite?",
        "date": "12/19/2022, 19:59:59"
    },
    {
        "title": "i like James Cameron",
        "body": "i think people dislike james Cameron mostly because he's a director who's been given a massive budget to fulfill a creative vision rather than make something that's more of a product.  does he have dumb takes? is he kind of an asshole? sure but most people in Hollywood do and are. i like james Cameron. i like that he's given big budgets to make the films that he really wants to make. i wish there were more block busters in Hollywood where it feels like it's trying to fulfill a creative vision.",
        "date": "12/19/2022, 19:59:54"
    },
    {
        "title": "The Last Emperor. Thoughts?",
        "body": "I watched it yesterday and... wow. It was an absolute ride. It was so surreal and so interesting. Seeing the emperor grow up was so cool, I almost wanted more of him when he was younger. Living in the Castle not being able to leave reminded me a lot of The Truman Show, which I also watched recently (wow to that movie too, definitely deserves it's own post) and there was so much to love. Seeing this old world slowly become Westernized. The bike, the glasses... and them speaking in English the entire time... I don't know why they decided to do that but it added to the surrealism, for better or worse.   The tutor was such a good character too. The wife was awesome too and that scene where the hands undress her as she kissed him... this movie was a fever dream in the best way at times. But then when they left the Castle, it felt like it became a different movie. The Emperor trying to hold onto his power, the only life he's ever known... I don't know enough about the history behind this, so I feel some of this was lost on me but it felt so tragic and I ended up hating and feeling bad for him. He's innocent, I can't blame him for holding onto the life he's ever known but he obviously made some bad decisions. But you can still see the love and goodness in him at odds with who he was taught to be.   Such a complex, fascinating and beautiful movie. Not to mention the SOUNDTRACK was so good. I knew Ryuichi Sakamoto from some other songs so when I saw his name I got so excited yet somehow I was still blown away.   Just wow, really. Such an amazing movie. I had to share my scattered thoughts as I'm on my commute.   How good are this directors other movies? Are there other historical movies that are worth watching in the same vein? I have no idea how accurate this movie was but it actually seems to be kind of honest, despite obvious dramatizations and artistic discretion. But I could be wrong",
        "date": "12/19/2022, 19:47:45"
    },
    {
        "title": "Good movies or TV series for English learners?",
        "body": "Hello. I try to learn maybe since half year. My dream and goal is watch movies or TV series in English even with subtitles. But maybe someone had the same situation like me and can recommend any movies or series where is good language for beginner in English?  Thanks for your recommendations and have a nice week. :)",
        "date": "12/19/2022, 19:20:17"
    },
    {
        "title": "Hey Ram (2000)",
        "body": "To all non Indians who enjoyed RRR. If you want to see the real British Colonial India during 1920s to 1940s. This is the one. Hey Ram (2000). Fictional story revolves around real events like Partition, Religious riots and mainly on Assassination of Gandhi. Surprisingly they didn't show bad British characters, a lot. This is India's submission for Oscars of that time. Great production and set pieces but some slight sloppy vfx of early 90s. Good story.  Worth watching.",
        "date": "12/19/2022, 18:32:00"
    },
    {
        "title": "The breakfast club",
        "body": "I've been a teacher wouldn't you just mark the books in the classroom giving the kids work to do in silence? The teacher sits in his office with the door slightly ajar. This would be a safeguarding issue and the teacher instantly dismissed. As any teache in any movie who falls asleep in class....Any other movies take liberty with jobs?",
        "date": "12/19/2022, 16:31:21"
    },
    {
        "title": "Hello Mary Lou: Prom Night II is a surprisingly wild and good horror movie from the 80s",
        "body": "I watched the Prom Night remake from 2008 and hated it. Then watched the original Prom Night from 1980 and felt it was just as bad. Decided to check out Mary Lou because the poster looks cool, knowing full well it would most likely be bad, bad, bad. It honestly surprised me how good it actually is, especially for a horror sequel from the 80s. It's genuinely creepy in parts (the rocking horse) and shocking (the locker room) and creative (the chalkboard whirlpool) and some wtf moments. It obviously took inspiration from Carrie, but it wasn't overly blatant. The acting is rather good as well and the special effects were well done for the time. It also works as a stand alone film so you don't need to watch the first one. Would watch again, for sure. It's a good time.",
        "date": "12/19/2022, 16:30:21"
    },
    {
        "title": "What was your take on the movie 'The Little Things' with Jared Leto, Denzel Washington and Rami Malek",
        "body": "**Spoiler warning**  First off I know I'm late this movies almost 2 years old   I'm trying to convince myself there's more to this movie but it screams Director gone too far in trying to be different without much constructive thought.   If you liked this movie I'd really like to know why and what you're take on it is because I honestly feel like I completely wasted 2 hours of life.    First of all.    Girl is chased on the road at night by a random car and forgets to call  authorities - or anyone.   The chaser stops his vehicle letting her get a sizeable lead on him.   He then creeps his car forward slowly to catch up because science dictates an object travelling 5 miles per hour can catch up to another object doing 30. That's how cars work.   The girl spots an empty gas station that's clearly closed - with her chaser far behind common sense tells her to get out of her vehicle and head to the gas station on foot.   Upon realising the gas stations closed she could get back into her car and speed off but decides she doesn't want to live so she sets off running into some weeds    The chaser at this point whose knowledge of speed has already been proven - slowly walks after the much younger woman whose running for her life.    The chaser is shown to be walking slowly in an area of flat land while the girl is running through weeds yet neither her or the truck driver who turns up see the person chasing her, we assume because the truck drivers never brought up.   We see fairly clearly that the chaser is a man, heavier set but not obese, straight walk, white male wearing a cap with facial hair and short head hair.    So this automatically rules out Albert, Jimmy or Deacon - right.  Ok.    At the end of the movie  Denzels character is still haunted by the past because he's made literally 0 strides in doing anything to solve that - ok?    Rami Maleks character is now also traumatised and kills someone - right.    Turns out Denzel also killed someone except it was a missing person….ok?    Cop and Coroner , fucking, cover up Denzels murder and were clearly willing to let whoever they found for the killings take the wrap for it and continue to let him work on the force - okedoke   But the missing person Denzel shot isn't the only missing person contributing to his trauma this is an irrelevant detail in the arc of the story….ok   Despite being an officer of the law and having a gun Malek becomes Leto's bitch digging all the holes in the world - cool bro.    So we get a 2 hour crime thriller with:   No character progression ☑️   A corrupt police force ☑️   The killers never caught ☑️    Dead girl gives Denzel a foot massage☑️   Rami and Denzel team up for quite literally no reason ☑️   Denzel accusing Jared Leto of having a boner = guilty ☑️   Rami Malek playing a cop who looks and speaks in more creepy fashion than Letos murderer-but-not-a-murderer character ☑️   Girl who was chased by the killer at the start for some reason takes note of Leto despite the fact she didn't see the fucker chasing her at the time.    She sees Jared, for the first time, in handcuffs and decides she needs a better look at him - *sigh* right.    And by the end - everything that happened in the movie becomes null, void and useless - why?    Becuase Albert Palm tree prime suspect is fucking dead.   Whether it was or wasn't him is now irrelevant - if it was he'll never pay and if it wasn't an innocent man's dead and Jimmys off the case anyway.    That's it. That's the conclusion of a 2 hour story    Creepy Albert for some reason has access to a plot of land - he convinces Malek, the police officer with a gun, to get into *his* car and then start digging up random bits of the land    He states that Deacon isn't welcome to join them yet he knows Deacons there, in Alberts time onscreen it's shown he's very aware of Deacons presence when following him - he knows Deacons a police officer whose going to probably notice his partners gone and so is the car he's been tailing all day.    Despite all of this Albert who is clearly not the killer, plans to kill Jimmy - the director who wanted to 'do something different' then has Jimmy smack Albert with a shovel which in typical fashion is enough to kill him instantly.    Nothing is discovered, no one is recovered and nothing really happens.",
        "date": "12/19/2022, 16:26:51"
    },
    {
        "title": "Everything everywhere from a different perspective",
        "body": "Movie is actually about Evelyn reliving her life through complete dementia, and her memories are entangled with the movies she loved to watch before she lost her mind (kong fu, ratatouille, matrix.) the movie's real ending happened in the parking lot where Joy left the party after watching her mother have a mental breakdown. Joy leaves the party to commit suicide, this is represented by the everything bagel that is revealed to be a black hole (death) and why Joy asks her mother to “let her go.” Since we know Evelyn repeatedly told her daughter she was getting fat, it is assumed that she probably did say it again in the parking lot but that they probably didn't hug afterwards like Evelyn recalls. Joy most likely went home and poisoned herself with an everything bagel. It is the last 'real' memory Evelyn has of Joy, and it's also why the memory isn't portrayed in another dimension. After the death of their daughter, Waymond continues with the divorce, and Evelyn presumably loses the family business. The memories Evelyn has of Deidra are real, and she absolutely loved her but they are seen as happening in the hotdog dimension because the relationship happens after the events of the movie and while Evelyn's dementia is in a worse state. The movie probably takes place in a much older Evelyn's mind, and the ending we see is how she thinks the events actually took place. We can see one last glimpse into how Evelyn zones out (dementia) right before the closing scene.",
        "date": "12/19/2022, 15:24:51"
    },
    {
        "title": "Strange memory. What movie?",
        "body": "I'm looking for a movie I saw when I was 5 or 6... I saw only one scene. A women who is naked or scantily dressed is laying on a couch or cushion on her side, smiling. A man is slowly walking towards her, mesmerized as if he's in a trance. I remember the music and mood being very eerie. Maybe she was in front of a window? I remember colors like a rainbow? Those two suggestions could be wrong... you know how memory can be. But this strange memory comes forward from time to time and I have to wonder what that movie was.  It looked to be made anywhere from 1960 to 1995 but I'm leaning towards it being an older film.   That's it haha. Any suggestions are appreciated, thanks",
        "date": "12/19/2022, 15:20:18"
    },
    {
        "title": "How much was real in the blanket party scene in Full Metal Jacket?",
        "body": "I've read/heard (don't remember the source) that Lee Ermey really did beat up his costars during the bunkhouse introduction scene. But I couldn't find if Vincent D'Onofrio really got struck by all those soap flails. Does anyone know?  If it was real, I wouldn't be surprised given how Kubrick was with Malcolm McDowell and Shelley Duvall.",
        "date": "12/19/2022, 15:04:43"
    },
    {
        "title": "Why don't they make more movies with endings like Gone Girl?",
        "body": "My favorite thing about this movie is the ending wasn't some typical cliche that most movies follow. They told you about an hour in that the wife faked it all to get her husband the death penalty and the movie just got better after that. Not only did she do all of that but she actually fakes a whole different crime to another guy and kills him just to get back to her husband.  There was a scene in the hospital where she called out the lead detective or officer for her being incompetent with how she handled the case. Usually in movies it'll be some kind of revenge thing or some way that the cop just HAS to get the truth. There was none of that. In the end there was no savior or magical evidence that arrested her.   They ended it with just truth and I felt that was one of the more realistic ways a movie has ended. I didn't see it coming at all and I actually was just waiting for something. A wire or a mistake. Unrelated but I watched Shutter Island and was much more impressed with the twist in Gone Girl compared to that. Movies always have to let the bad guy get caught. This was a pleasant surprise. I hope I find more movies like this.",
        "date": "12/19/2022, 14:52:37"
    },
    {
        "title": "Is Hook (1991) a Christmas movie?",
        "body": "I am in a heated debate with my bf about this.  Is Hook a Christmas movie?   His argument : it takes place during Christmas. And the spirit of the movie is heartwarming/loving and happy like a Christmas movie should be.   My argument: Christmas is only a brief mention and NOT thought of again even at the end. I think as soon as they go to Never Never Land it's forgotten about. (Ps - yes, I think Die Hard IS a Christmas movie)  It's true, at the beginning they have a Santa themed baseball tournament and they go to England for Christmas.. But it's not memorable / even spoken about by the characters...",
        "date": "12/19/2022, 14:13:07"
    },
    {
        "title": "Triple Features?",
        "body": "What are ideas that pop into peoples' heads of movies that they think would make great triple features as some kind of DVD/streaming collection or list to recommend to someone looking for films with similar themes/ stylistic elements that would make good compare/contrast discussions?   My picks:   1. Arrival (2016); Annihilation (2018); Memoria (2021/2022)  2. Antichrist (2009); mother! (2017); Men (2022)  3. Perfect Blue (1997/1998); Black Swan (2010); Enemy (2013/2014)  4. Border (2018); You Won't Be Alone (2022); Bones and All (2022)  5. Never Let Me Go (2010/2011); Evolution (2015/2016); The White King (2016/2017)  6. Her(2013); Ex Machina (2015); The Trouble With Being Born (2020/2021)  7. Under the Skin (2013/2014); Spring (2014/2015); The Untamed (2016/2017)  8. Being John Malkovitch (1999); Stranger Than Fiction (2006); Everything Everywhere All at Once (2022)  9. Melancholia (2011); Another Earth (2011/2012); Aniara (2018/2019)  10. Sunshine (2007); Europa Report (2013); Interstellar (2014)  11. Angel's Egg (1985); Mécanix (2003); Mad God (2021/2022)",
        "date": "12/19/2022, 13:42:22"
    },
    {
        "title": "can I get some movie recommendations?",
        "body": "It's been awhile since a movie I have seen was amazingly good and I want to see one. Some movies that have really impressed me were whiplash, the perks of being a wallflower, and tick tick boom and I want to see another movie about very serious subject matter again. Could you guys help me out with this?",
        "date": "12/19/2022, 13:35:38"
    },
    {
        "title": "Sci-fi movie where they're on a long journey and just operating/maintaining the ship?",
        "body": "I'd like a slow space travel movie where they have to keep the ship working.  Star Trek: The Motion Picture is sort of good for the first half, when they're trying to get the ship working.  Alien is in the ballpark too, only I'm more interested in the crew running the ship, don't need alien attack stuff.  Parts of Empire Strikes Back have this, constantly trying to fix the Falcon and get where they're going.  Any suggestions?",
        "date": "12/19/2022, 13:30:26"
    },
    {
        "title": "I just notice a detail about It Comes at Night (2017)",
        "body": "There's some light speculation as to whether Andrew (the kid) was actually sick, although most would probably say he was. At the end when Sarah is holding a gun to Will, he says we just want enough (food and water) for both of us. Not for the three of us. Even Will is mentally resigned to his son will die from the disease soon, chilling.",
        "date": "12/19/2022, 13:21:43"
    },
    {
        "title": "Looking for recommendations on movies about Male Characters that are shut-ins, introverts or loner types.",
        "body": "I'm a fan of movies where a character isn't social and keeps to themselves or just doesn't fit in with others.   I'm a fan of movies like Marty with Ernie Borgnine, Lars and the Real Girl, 40 year old virgin.   I just recently saw an Icelandic movie called Virgin Mountain that really got to me and the ending made me pretty happy. Kind of relatable for me.   I'm looking to see if anyone can recommend any similar movies to these.   I know these mostly focus on romance genre but I'm more interested in films that focus on self improvement or coming to terms with situations and deciding to make changes.   Any recommendations are welcomed.",
        "date": "12/19/2022, 13:21:32"
    },
    {
        "title": "Let's play a game called add/change/remove",
        "body": "Its a simple game, say a movie (whether good or bad) gets remade for whatever reason. What would you Add, What would you Change and what would you Remove? (also there will be spoilers)  The movie I've chosen is treasure planet because its my favourite movie:  Add:  I would add more lore to either captain flint or the ancients and their technology as I feel like both were mostly shafted.   Change:  Captain Amelia and Dr Doppler were great characters but I felt the ending where >!(they get married and have kids)!< a bit unearned as they were mostly fighting with each other. I would change it so they'd have more in common like a shared interest in astrology.  Remove:  The goddamn farting alien, That was DreamWorks shit",
        "date": "12/19/2022, 13:18:25"
    },
    {
        "title": "Spoiler Question About Everything, Everywhere, All At Once.",
        "body": "I just finished Everything, Everywhere, All At Once and really enjoyed it. While I was able to understand almost everything there was one part of the movie I needed clarification on. When Evelyn dies and comes back is she in the same universe as when the movie started? It felt like she was supposed to be but earlier in the movie she and her husband were on the news for the attack at the IRS office. What am I missing here?",
        "date": "12/19/2022, 13:11:22"
    },
    {
        "title": "I Think It Would Be Interesting to See a Film From the Past Remade Exactly The Same just to see what Rating It Would Get Today!",
        "body": "I think it would interesting to take a film, like Jaws, and remake it exactly the same (shots, film stock, dialogue just to see what type of rating it would get from the MPA. Jaws is a film that would definitely get an R-rating if made today. I would just like to see what the MPA would give a film if it were exactly the same everything but they were made now as appose to its release year. Would Gremlins get a PG-13 rating today? No way it gets the original film's PG rating, but I think it would get an R-rating. The film looks like an R-rated film today. I would find it interesting if anyone has a film they would like to see remade for the sole purpose is to see what the rating it would get today.",
        "date": "12/19/2022, 13:02:57"
    },
    {
        "title": "Epic action movies",
        "body": "I'm looking for movies like bad boys for life, nobody, bullet train, John wick or the graymen, basically any movie where the main character fights a lot of bad guys by himself or where the main character has a normal life but has a violent backstory and a series of events happen that causes the main character to fight a lot bad guys",
        "date": "12/19/2022, 13:00:21"
    },
    {
        "title": "in their own rights/fields, who do you think is a better director, Nolan Vs. Tarantino",
        "body": "they both make completely different styles of work and it's safe to say they both have changed some rules of cinema in an impactful way.   but in their own dimension, who do you think is better  if I'm correct I think they both got the same amount of films in their category so this should be fun to compare.",
        "date": "12/19/2022, 12:59:52"
    },
    {
        "title": "The Last Duel",
        "body": "I just recently watched this one and actually really liked it. I understand why people wouldn't, it's a slow burn and obviously there is some triggering content but I thought the lead up to the final duel was really satisfying. I read somewhere that it was a “flop”.  What is you all opinions on it and why do you think it didn't do well? Personally it made me buy the book it was based on, I thought it was really interesting.  Plus I love Adam Driver and always love when Ben Affleck and Matt Damon star in a movie together",
        "date": "12/19/2022, 12:32:55"
    },
    {
        "title": "Weird: The Al Yankovic Story is the best movie of 2022",
        "body": "Weird: The Al Yankovic Story is the best movie of 2022  It's not even close   Actually it's the best movie ever. A parody movie about a parody musician. That parodies movie parodies.   If Daniel Radcliffe doesn't win the Oscar then the world deserve to just DIE!!!  The real truth of the death of Pablo Escobar is now finally known due to this factually accurate documentary film.  And if you ever wonder what the hell became of Madonna….",
        "date": "12/19/2022, 12:16:52"
    },
    {
        "title": "Freedom Writers",
        "body": "This is a really beautiful movie starring Hilary Swank.  Freedom Writers . About a newly hired English teacher that has been accepted to teach a classroom of troubled kids that were involved in racial gang war-fare, violence and discrimination. She tries to get an idea of why these students were misbehaving and causing drama so she gets them a journal as a personal diary to express their background and their past to understand why these kids are this way. She brought up about the Holocaust to teach these students what real hardship and discrimination was like back then to help these students learn that their lives isn't as bad compared to how the Jews were treated.",
        "date": "12/19/2022, 12:10:57"
    },
    {
        "title": "What are your best theater experiences?",
        "body": "After the disaster that was Avatar 2 screening for me, where someone brought a baby, two friends to the left were constantly looking at their phones, and a group of teenagers came in more than halfway through and laughed, talked throughout the entire third act.  I reminisced on my favorite/best theater experiences:  -Seeing Men in the middle of the summer on a weekday during a noon showing (only $6.66 ticket), and being one of only three people in there with the biggest screen in the theater, two other people were also guys by themselves and they didn't make a peep throughout the entire thing. Great stuff  -Seeing Titane, with only a young couple, the young couple then left about a half an hour through it. And I got to watch a great movie all by myself, so I could laugh hysterically when she does a seductive dance in the firehouse  -Seeing Barbarian with a great crowd on opening Thursday night, and genuinely shocked at how much I loved it, considering marketing was pretty nill leading up to it.  -Seeing The Green Knight with a group of high people around my age, no one was disrespectful, everyone was just taking in everything and just having a crazy experience considering the content. They were genuinely into it, even though they didn't know what to think when it ended.  -Saw Thousand Years of Longing in an empty theater, wish I liked it more, but being all by myself and only paying $7 for a ticket is the best thing in the world",
        "date": "12/19/2022, 12:10:38"
    },
    {
        "title": "What movie has the best interrogation scene?",
        "body": "For me, I think The Dark Knight (2008) comes real close! The amount of intensity towards the end will always blow my mind, as Batman gets impatient while the Joker is having his fun with getting under his skin despite being brutally beaten to a pulp!  It brought insanity to a whole new level, that laugh will always be stuck in my mind every time I think about this movie!",
        "date": "12/19/2022, 12:09:52"
    },
    {
        "title": "2022 Was The Best Year For Movies Since...",
        "body": "Easily the most stacked year of the decade thus far, due to obvious reasons lol, but I think it easily beats the years leading up to COVID as well. There definitely were some duds, but overall I would say it was a fantastic year.  The big blockbusters this year were extraordinary: Top Gun Maverick, The Batman, Wakanda Forever, Avatar 2 Some big surprises: Everything Everywhere All At Once, Banshees of Inisherin, Barbarian, Unbearable Weight of Massive Talent Good popcorny blockbusters: Uncharted, Scream, Doctor Strange, Black Adam, Halloween Ends, Violent Night And some great others like Nope or Glass Onion which we've been waiting for thanks to COVID.   When was the last time we got a year this solid?",
        "date": "12/19/2022, 11:46:21"
    },
    {
        "title": "What movie did someone choose that was so bad that that person lost the privilege to ever choose another movie?",
        "body": "With the holidays being upon us, my sister and I were chatting about movies we might see on Christmas Day (my family's holiday tradition). We wondered if it was time to lift the ban my mom has had for the past 31 years. You see…way back in 1991 for her birthday she chose for the whole family to go see the Dan Aykroyd, Chevy Chase, and Demi Moore film “Nothing But Trouble”. After the movie was over we banned her from choosing ever again. Even my dad who would do anything for my mom was on board with the banning.  So what movie did someone choose that earned them a very, very long ban from ever choosing another movie?  <postscript>  My mom can actually choose movies. We just you always say “this better not be another Nothing But Trouble choice”  </postscript>",
        "date": "12/19/2022, 11:24:46"
    },
    {
        "title": "Movies with cool war paint",
        "body": "Hello. I am looking for inspiration for makeup and I want to do a warrior theme.   I'm looking for movies that have preferably colorful war paint on a character. A great example is neyteri in the final act of avatar (2009) or Jake sully from the same movie. Movie recommendations I can pull a still from and use it as inspo. Thank you all!",
        "date": "12/19/2022, 11:22:58"
    },
    {
        "title": "Movies that you loved when you were younger that don't hold up as an adult?",
        "body": "I'm sure everyone has a few. I rewatched Mallrats for the first time in many years the other day. My sister and I loved this movie when we were kids. I might get some hate for this but it's really just a dumber rewrite of Clerks. The Dante/Randall dichotomy are reworked with different actors and less nuance. The goofy happy ending is ridiculous whereas Clerks was more ambiguous. Jason Lee is still fun to watch in this film, but I found the main character (played by Jeremy London) very unlikable. Still some good scenes, but not near as good as I remember.",
        "date": "12/19/2022, 11:10:14"
    },
    {
        "title": "What are the quintessential 1950s themed movies?",
        "body": "What are the quintessential 1950s themed movies?  Like, stuff like Happy Days, Elvis movies, Grease,  the outsiders, stuff like that… I need sock hops, soda fountains, sweet cars, greaser hair, record players, political stuff, give me the goods people! Tysm in advance <3 EDIT- I guess I need to add more info here! I wanna see oldschool ways of life, outdated relationship standards, old labels/ brands/ products that don't exist anymore, old music, dwelling interiors that aren't furnished that way anymore…. Ahhh! :)) EDIT AGAIN- I dont necessarily mean movies made in the 50s, just stuff with that slick vibe",
        "date": "12/19/2022, 11:03:34"
    },
    {
        "title": "What's a movie that is a real gem but because of bad timing/publicity/perception never got the recognition it deserved?",
        "body": "This was inspired by the recent post that Arnold is better than Stallone and everyone completely disagreeing with that. One example that kept coming up was Cop Land. So I watched it and it's great. Stallone, DeNiro, Ray Liotta, Agent Dogget, Jimmy Garoppolo. No less than FOUR other people that are at the very least “Oh I know that guy!”  But I remember when it came out and the public perception was “Sylvester Stallone is doing a movie where he's fat.” That was the whole thing. Stallone is doing a movie where he's a fat cop.   It is so much more than that.   What other movies got this sort of treatment but are actually great?",
        "date": "12/19/2022, 11:03:03"
    },
    {
        "title": "Which sci fi movie strikes you the most",
        "body": "The question is quite straightforward, this could be for any reason, or  multiple reasons. Science you didn't know of, relation to the real life,  narrative, sound design, acting and so on.   It could also be because a sci fi movie holds an important message, dangers to technology, or just another take on how we perceive things.   The fiction is sci fi is interesting because with some sci fi movies the fiction comes closer to reality as time passes by, or it gives you another take on certain things immediately.  It doesn't have to be about that , it could also be because the movie is extremely well made, or both.   Make sure to use the spoiler bar accordingly",
        "date": "12/19/2022, 10:44:44"
    },
    {
        "title": "Smoothing stop motion with A.I.",
        "body": "Is there A.I. software that could take a movie like The Nightmare before Christmas and analyze each frame and smooth out the movements between each frame?  I think it would be cool to see.  I get that there will be a purist argument to leave art alone in its glory...  Would it take two different A.I. protocols to achieve smoothness.... one for the character animations and one for the camera?  Or once the original film is mastered are each frame esaentially a still frame picture?",
        "date": "12/19/2022, 10:41:08"
    },
    {
        "title": "A movie where the 'Literally me' character gets help?",
        "body": "The 'Literally me' caricature has had a major influence over recent times, targeting young and lonely men as its demographic as these people are able to find strong relatability and sympathy towards the caricature struggles. Good examples of these movies include Taxi Driver, American Psycho, Nightcrawler, Joker etc I think you get the picture. A problem I see in these films are that they don't offer solutions to these lonely men, rather they emphasise that there is no exit out of this crazy world and the protagonists of their respective stories continue to suffer and recieve no help for their struggle. Are there any films out there which are able to simultaniously tap into the minds of these lonely men, and also show them that there's a way out of the cycle of loneliness and depression? Lonely men are able to relate towards these characters, but the characters they relate to are given no way to escape their cycle of loneliness, and so these men are gonna start believing that there's no escape for them too. What I believe is needed is a story that can show these men who need desperate help that there's still hope to hold onto, and that this cycle of loneliness isn't forever.",
        "date": "12/19/2022, 10:31:19"
    },
    {
        "title": "what's a film in the last five years that you believe a classic that'll be praised for decades to come.",
        "body": "im talking on the level of godfather, scarface, etc. what film in the last five years do you think came close to those  I was arguing with a friend when I said cinema has taken a slight decline recently when it comes to quality. I'm not saying movies has been terrible but I don't think a classic has came in the last five years  a classic film I'd consider is probably Wolf of Wall Street or gone girl or ex machina (EDIT) I'm mentioning these films as in the last time a classic film came out, yes ik they're not from 5 yrs ago",
        "date": "12/19/2022, 10:20:02"
    },
    {
        "title": "I just had the perfect idea for a 300 sequel",
        "body": "So if you don't know the 300 movies were originally going to spark a full anthology series taking place in different battles across history. Zach Snyder wanted to make a movie taking place in the American Revolution, but Rise of an Empire was so bad he canceled it. So I watched Filmento's take on Rise of an Empire and thought up the perfect idea for a 300-style American war movie. Looking at all the aspects of the other two to make it.   1. Strong character  What made 300 such a good movie was its leading character, Leonidas was the King of Sparta and an inspiration to all of Greece. The movie shows this by having him go through struggles and trials, we see his origins as a young boy who was always on the verge of death and we see how it made him a skilled warrior and aspiring leader. But Rise of an Empire doesn't have that, hell, I don't even remember the main character's name. He's just an Athenian hoplite who killed Xerxes's father and is fighting a fleet that is never given any importance.   This is something we can fix with the Revolutionary War movie, George Washington is already the perfect candidate for the movie. As American history portrays him, he was a Virginian farmer who got selected for the British Army and lead a group of Natives to attack a French fort, triggering the French and Indian War. Already we have a backstory that can be delivered in perfect Zach Snyder fashion. George Washington also had to go through obstacles and challenges, he wasn't a good general in his early time and had to work to be the best, when the nation founded the Articles of Confederation had no way of collecting taxes for the states which caused his men to starve. He and his army were going to collapse until a Mercenary came and helped train the men. Hell, we could even give him John Wick fighting styles to make his character better.   2.  Exaggerated world  The point of 300 was that it was propaganda told by an untrustworthy narrator who explained everything the same as any Greek man in the war would think during ancient times. The Persian army was mostly dudes and skilled warriors, but the movie showed dudes, giant animals, immortal demons, and even whatever the hell that big guy was. Rise of an Empire didn't have this, sure we had dudes in tighty whities killing fully clothed dudes, but that was it. The only cool element of that movie was those shark monsters that are only a dream sequence.   The American Revolution was full of propaganda portraying the British as killers shooting innocent people and Americans as freedom fighters. The British enlisted different types of men to help fight for their cause as well. These included Native American warriors, Hessian Mercenaries, and escaped slaves. Hessians were already seen as boogeyman-type figures by the Colonists so it wouldn't be hard to portray them the same way immortals are portrayed in the movies. They could be these weird green reptilian monsters that speak inhumanely or giant black knights on horseback chopping people's heads off. Natives obviously could be seen in a similar way.   We could even have creatures from Native American mythology and European lore fighting on both sides creating chaos. Maybe Washington needs the help of an Oneida Shaman who takes him on a drug trip like in a Far Cry game. There could be giant wolves ripping throats or Bigfoot even, that's a no-brainer.   Obviously, historical accuracy wouldn't be a problem here since when did the last two films focus on that?   I'm not saying this would be a good idea, but it at least makes a sequel worthy of 300's name, what are your suggestions?",
        "date": "12/19/2022, 09:56:19"
    }
]